{
  "1.13.3": {
    "en": "Moved installation instructions from app store to community support topic."
  },
  "1.14.0": {
    "en": "Added support for Shelly Dimmer/SL (thx to domotica-shop.nl for supplying the device)"
  },
  "1.14.1": {
    "en": "Skip the login credentials screen during pairing for devices that do not have authentication set up."
  },
  "1.14.2": {
    "en": "Fixed issue with pairing introduced with previous version (1.14.1)."
  },
  "1.15.0": {
    "en": "Added support for the Shelly Door Window Sensor."
  },
  "1.16.0": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience."
  },
  "1.16.1": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience. Also added support for the temperature add-on for the Shelly 1 and Shelly 1PM."
  },
  "1.16.2": {
    "en": "Small fixes for Shelly 2 and Shelly 4 Pro."
  },
  "1.16.3": {
    "en": "Added new driver for Shelly 2.5 Rollershutter, you can re-pair it if you have paired as Shelly 2(.5) Rollershutter. Fixed an issue where devices from another type could show up in the pairing wizard. Small improvement to the pairing wizard which might resolve blank screens and timeouts. Added a new trigger card for Shelly 1 and Shelly1PM which can be triggered using the callback URLs. These need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions."
  },
  "1.17.0": {
    "en": "BREAKING CHANGES SHELLY EM: the Shelly EM driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your Shelly EM. Sorry for the inconvenience. Als support for the new Shelly 3EM has been added with the release."
  },
  "1.17.1": {
    "en": "Small fix for discovery of Shelly 3EM."
  },
  "1.17.2": {
    "en": "BREAKING CHANGES Shelly 2.5 Relay: The Shelly 2.5 Relay driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Also other small fixes and improvements."
  },
  "1.17.3": {
    "en": "BREAKING CHANGES RGBW2 4xWHITE: The RGBW2 4xWhite driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Added a toggle button for the RGBW2 Color to switch between white and color mode. Added trigger cards for the Shelly Dimmer to trigger flows based on input 1 and 2."
  },
  "1.17.4": {
    "en": "Fixes for trigger cards that may also cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.5": {
    "en": "Fixes for trigger cards and missing capabilities for paired devices that may cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.6": {
    "en": "Fix issue with incorrect readings for meter_power and meter_power_wmin capabilities for Shelly 2.5"
  },
  "1.17.7": {
    "en": "Fixed a bug in the callback trigger card for Shelly1PM. Added the callback trigger card functionality for the Dimmer, Shelly2, Shelly2.5, Plug, Plug-S, ShellyEM and Shelly3EM. These callback URLs need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions. "
  },
  "1.18.0": {
    "en": "Added support for Shelly Duo and Shelly Vintage."
  },
  "1.18.1": {
    "en": "Fixed bugs with setting callback URL for various Shelly devices. Added a reboot action card which reboots your Shelly."
  },
  "1.18.2": {
    "en": "Bugfixes for RGBW2 White and the triggercard 'Meter Power in Wmin changed' for Shelly 2.5"
  },
  "1.19.0": {
    "en": "Added support for the Shelly Smoke Detector."
  },
  "1.19.1": {
    "en": "Added the callback trigger card functionality to the Shelly Door/Window sensor. This is more reliable then the current polling implementation. See the documentation on how to use this."
  },
  "1.19.2": {
    "en": "Two fixes for using callback URL's for the Shelly Door/Window sensor."
  },
  "1.20.0": {
    "en": "Breaking changes: The recently added triggercard for button action callbacks will break because it is replaced by a more generic Action URL card, please update your flows. Polling for the Shelly Flood has been removed and is replaced by report callbacks from the device itself as this is much more reliable. If you have a paired Shelly Flood, please perform the URL callbacks maintenance action to set the callback urls (see the support topic for further instructions). Added manual pairing fallback for all drivers, this is handy for those with segmented networks where auto discovery does not work. And there are some small fixes in various drivers in this release as well."
  },
  "1.20.1": {
    "en": "Fix for reboot action card and small improvement for setting callback URL's (appearently the Shelly needs a reboot for these to become active)."
  },
  "1.20.2": {
    "en": "Fixed issue with duration in the \"Change roller shutter\" action card."
  },
  "1.20.3": {
    "en": "Fix for triggercard for temperature sensor Shelly 1PM."
  },
  "1.20.4": {
    "en": "Fix for setting white channel on Shelly RGBW2."
  },
  "1.21.0": {
    "en": "BREAKING CHANGES: Deprecated the device \"Action event\" triggercard and replaced it with a generic \"Action event\" card which is not device specific but contains the device name as token. This is easier to maintain. Please update your flows by replacing the device specific card with the triggercard from the app. The functionality for the device specific card will be removed with the next major release. Also added support for the new Shelly i3 which was released two days ago, thanx to domotica-shop.nl for sending me a device. Also added a new triggercard that can trigger a flow when a device is unreachable for a specified number of minutes (under device settings). This is only available for non-battery operated devices that are being polled for their status. And also lots a code refactoring for easier maintenance. "
  },
  "1.21.1": {
    "en": "Added a parameter for the Shelly 2(.5) Roller Shutter which allows you to configure the optical middle as 50%. Useful for roller shutters that do not move the blinds linear and where 50% is not the optical middle. The optical middle can be set under the device maintenance actions. Also added an action card for the Shelly 2(.5) for moving the blinds with an offset percentage. And added an action card for the Shelly 2(.5) for which fires and intelligent action, it will stop the roller shutter when it's moving, opens it if closed and closes it if opened."
  },
  "1.22.0": {
    "en": "Added a parameter for the Shelly 2(.5) Roller Shutter which allows you to configure the optical middle as 50%. Useful for roller shutters that do not move the blinds linear and where 50% is not the optical middle. The optical middle can be set under the device maintenance actions. Also added an action card for the Shelly 2(.5) for moving the blinds with an offset percentage. And added an action card for the Shelly 2(.5) for which fires and intelligent action, it will stop the roller shutter when it's moving, opens it if closed and closes it if opened."
  },
  "1.22.1": {
    "en": "Added callback events for the Shelly 2(.5) Roller Shutter."
  },
  "1.22.2": {
    "en": "Fix for Shelly 2(.5) where setting position returns an error due to incorrect device settings."
  },
  "1.22.3": {
    "en": "Add support for Shelly Dimmer 2"
  },
  "1.23.0": {
    "en": "Added device ID to callback trigger card and removed the old button events card which was deprecated since the last couple of app versions."
  },
  "1.24.0": {
    "en": "Added support for Shelly Gas and Shelly Button 1. Also added the option to add a custom device icon (.svg) during pairing for the Shelly Gas, Shelly Button 1, Shelly Plug, Shelly Plug-S, Shelly1 and Shelly 2. More devices will follow. If you want to use a custom icon for an existing devices re-pairing is required. It cant be changed after pairing."
  },
  "1.25.0": {
    "en": "Added the option for custom device icons (.svg) for all devices. If you want to use a custom icon for an existing devices re-pairing is required. It cant be changed after pairing. Also optimized the way the action events / callbacks work. For the Shelly Door/Window sensor this means the events open_dark and open_twilight have changed to dark and twilight. And replaced the polling of the Shelly H&T sensor to using the report url callback functionality. Also reduced lines of code by re-using templates."
  },
  "1.25.1": {
    "en": "Fix for issue with Shelly HT driver."
  },
  "1.25.2": {
    "en": "Fix for Shelly HT and Shelly Button 1 crashes."
  },
  "1.25.3": {
    "en": "Fix for Shelly HT and Shelly Button 1 crashes and fix for custom device icon for devices with multiple device instance upon pairing."
  },
  "1.25.4": {
    "en": "Added support for Shelly Door/Window sensor 2 and added the tamper capability to the Door/Window sensor (2)."
  },
  "1.25.5": {
    "en": "Fix issue with pairing devices introduced with version 1.25.4."
  },
  "1.25.6": {
    "en": "Added temperature and tilt capability to the Shelly Door/Window (2) sensor and some other minor improvements."
  },
  "3.0.0": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.1": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.2": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.4": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.5": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.6": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.7": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.8": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.9": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.10": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.11": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.12": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.13": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.14": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  }
}
