{
  "1.13.3": {
    "en": "Moved installation instructions from app store to community support topic."
  },
  "1.14.0": {
    "en": "Added support for Shelly Dimmer/SL (thx to domotica-shop.nl for supplying the device)"
  },
  "1.14.1": {
    "en": "Skip the login credentials screen during pairing for devices that do not have authentication set up."
  },
  "1.14.2": {
    "en": "Fixed issue with pairing introduced with previous version (1.14.1)."
  },
  "1.15.0": {
    "en": "Added support for the Shelly Door Window Sensor."
  },
  "1.16.0": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience."
  },
  "1.16.1": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience. Also added support for the temperature add-on for the Shelly 1 and Shelly 1PM."
  },
  "1.16.2": {
    "en": "Small fixes for Shelly 2 and Shelly 4 Pro."
  },
  "1.16.3": {
    "en": "Added new driver for Shelly 2.5 Rollershutter, you can re-pair it if you have paired as Shelly 2(.5) Rollershutter. Fixed an issue where devices from another type could show up in the pairing wizard. Small improvement to the pairing wizard which might resolve blank screens and timeouts. Added a new trigger card for Shelly 1 and Shelly1PM which can be triggered using the callback URLs. These need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions."
  },
  "1.17.0": {
    "en": "BREAKING CHANGES SHELLY EM: the Shelly EM driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your Shelly EM. Sorry for the inconvenience. Als support for the new Shelly 3EM has been added with the release."
  },
  "1.17.1": {
    "en": "Small fix for discovery of Shelly 3EM."
  },
  "1.17.2": {
    "en": "BREAKING CHANGES Shelly 2.5 Relay: The Shelly 2.5 Relay driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Also other small fixes and improvements."
  },
  "1.17.3": {
    "en": "BREAKING CHANGES RGBW2 4xWHITE: The RGBW2 4xWhite driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Added a toggle button for the RGBW2 Color to switch between white and color mode. Added trigger cards for the Shelly Dimmer to trigger flows based on input 1 and 2."
  },
  "1.17.4": {
    "en": "Fixes for trigger cards that may also cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.5": {
    "en": "Fixes for trigger cards and missing capabilities for paired devices that may cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.6": {
    "en": "Fix issue with incorrect readings for meter_power and meter_power_wmin capabilities for Shelly 2.5"
  },
  "1.17.7": {
    "en": "Fixed a bug in the callback trigger card for Shelly1PM. Added the callback trigger card functionality for the Dimmer, Shelly2, Shelly2.5, Plug, Plug-S, ShellyEM and Shelly3EM. These callback URLs need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions. "
  },
  "1.18.0": {
    "en": "Added support for Shelly Duo and Shelly Vintage."
  },
  "1.18.1": {
    "en": "Fixed bugs with setting callback URL for various Shelly devices. Added a reboot action card which reboots your Shelly."
  },
  "1.18.2": {
    "en": "Bugfixes for RGBW2 White and the triggercard 'Meter Power in Wmin changed' for Shelly 2.5"
  },
  "1.19.0": {
    "en": "Added support for the Shelly Smoke Detector."
  },
  "1.19.1": {
    "en": "Added the callback trigger card functionality to the Shelly Door/Window sensor. This is more reliable then the current polling implementation. See the documentation on how to use this."
  },
  "1.19.2": {
    "en": "Two fixes for using callback URL's for the Shelly Door/Window sensor."
  },
  "1.20.0": {
    "en": "Breaking changes: The recently added triggercard for button action callbacks will break because it is replaced by a more generic Action URL card, please update your flows. Polling for the Shelly Flood has been removed and is replaced by report callbacks from the device itself as this is much more reliable. If you have a paired Shelly Flood, please perform the URL callbacks maintenance action to set the callback urls (see the support topic for further instructions). Added manual pairing fallback for all drivers, this is handy for those with segmented networks where auto discovery does not work. And there are some small fixes in various drivers in this release as well."
  },
  "1.20.1": {
    "en": "Fix for reboot action card and small improvement for setting callback URL's (appearently the Shelly needs a reboot for these to become active)."
  },
  "1.20.2": {
    "en": "Fixed issue with duration in the \"Change roller shutter\" action card."
  },
  "1.20.3": {
    "en": "Fix for triggercard for temperature sensor Shelly 1PM."
  },
  "1.20.4": {
    "en": "Fix for setting white channel on Shelly RGBW2."
  },
  "1.21.0": {
    "en": "BREAKING CHANGES: Deprecated the device \"Action event\" triggercard and replaced it with a generic \"Action event\" card which is not device specific but contains the device name as token. This is easier to maintain. Please update your flows by replacing the device specific card with the triggercard from the app. The functionality for the device specific card will be removed with the next major release. Also added support for the new Shelly i3 which was released two days ago, thanx to domotica-shop.nl for sending me a device. Also added a new triggercard that can trigger a flow when a device is unreachable for a specified number of minutes (under device settings). This is only available for non-battery operated devices that are being polled for their status. And also lots a code refactoring for easier maintenance. "
  },
  "1.21.1": {
    "en": "Added a parameter for the Shelly 2(.5) Roller Shutter which allows you to configure the optical middle as 50%. Useful for roller shutters that do not move the blinds linear and where 50% is not the optical middle. The optical middle can be set under the device maintenance actions. Also added an action card for the Shelly 2(.5) for moving the blinds with an offset percentage. And added an action card for the Shelly 2(.5) for which fires and intelligent action, it will stop the roller shutter when it's moving, opens it if closed and closes it if opened."
  },
  "1.22.0": {
    "en": "Added a parameter for the Shelly 2(.5) Roller Shutter which allows you to configure the optical middle as 50%. Useful for roller shutters that do not move the blinds linear and where 50% is not the optical middle. The optical middle can be set under the device maintenance actions. Also added an action card for the Shelly 2(.5) for moving the blinds with an offset percentage. And added an action card for the Shelly 2(.5) for which fires and intelligent action, it will stop the roller shutter when it's moving, opens it if closed and closes it if opened."
  },
  "1.22.1": {
    "en": "Added callback events for the Shelly 2(.5) Roller Shutter."
  },
  "1.22.2": {
    "en": "Fix for Shelly 2(.5) where setting position returns an error due to incorrect device settings."
  },
  "1.22.3": {
    "en": "Add support for Shelly Dimmer 2"
  },
  "1.23.0": {
    "en": "Added device ID to callback trigger card and removed the old button events card which was deprecated since the last couple of app versions."
  },
  "1.24.0": {
    "en": "Added support for Shelly Gas and Shelly Button 1. Also added the option to add a custom device icon (.svg) during pairing for the Shelly Gas, Shelly Button 1, Shelly Plug, Shelly Plug-S, Shelly1 and Shelly 2. More devices will follow. If you want to use a custom icon for an existing devices re-pairing is required. It cant be changed after pairing."
  },
  "1.25.0": {
    "en": "Added the option for custom device icons (.svg) for all devices. If you want to use a custom icon for an existing devices re-pairing is required. It cant be changed after pairing. Also optimized the way the action events / callbacks work. For the Shelly Door/Window sensor this means the events open_dark and open_twilight have changed to dark and twilight. And replaced the polling of the Shelly H&T sensor to using the report url callback functionality. Also reduced lines of code by re-using templates."
  },
  "1.25.1": {
    "en": "Fix for issue with Shelly HT driver."
  },
  "1.25.2": {
    "en": "Fix for Shelly HT and Shelly Button 1 crashes."
  },
  "1.25.3": {
    "en": "Fix for Shelly HT and Shelly Button 1 crashes and fix for custom device icon for devices with multiple device instance upon pairing."
  },
  "1.25.4": {
    "en": "Added support for Shelly Door/Window sensor 2 and added the tamper capability to the Door/Window sensor (2)."
  },
  "1.25.5": {
    "en": "Fix issue with pairing devices introduced with version 1.25.4."
  },
  "1.25.6": {
    "en": "Added temperature and tilt capability to the Shelly Door/Window (2) sensor and some other minor improvements."
  },
  "3.0.0": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.1": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.2": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.4": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.5": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.6": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.7": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.8": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.9": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.10": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.11": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.12": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.13": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.14": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.15": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.16": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.17": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.18": {
    "en": "Please see the support forum for the change log. The release contains too much (breaking) changes to be added in the changelog here."
  },
  "3.0.19": {
    "en": "Added a app setting to disable all CoAP traffic and fallback to basic HTTP polling. This is useful for users that have a lot of Shelly devices and are experiencing app crashes on version 3.0.18 while this is being investigated. Also fixed an issue with offline Shelly RGBW2 White."
  },
  "3.0.21": {
    "en": "Please see the changelog on the community forum support topic (link is at the bottom of this page) as it's to long to mention here."
  },
  "3.0.22": {
    "en": "Please see the changelog on the community forum support topic (link is at the bottom of this page) as it's to long to mention here."
  },
  "3.0.23": {
    "en": "Please see the changelog on the community forum support topic (link is at the bottom of this page) as it's to long to mention here."
  },
  "3.0.24": {
    "en": "Please see the changelog on the community forum support topic (link is at the bottom of this page) as it's to long to mention here."
  },
  "3.0.25": {
    "en": "Please see the changelog on the community forum support topic (link is at the bottom of this page) as it's to long to mention here."
  },
  "3.0.26": {
    "en": "Fixed missing Input 2 trigger card for dimmer, fixed input condition cards and added the input state to the device pages."
  },
  "3.0.27": {
    "en": "Switch to unicast for Shelly devices with firmware 1.10.0 or higher for better network compatibility (please enable CoAP again in the app settings if you have previously disabled it), also added HTTP polling every minute as backup and fixed an issue with pairing of the Shelly Vintage."
  },
  "3.0.28": {
    "en": "Fixed an issue with the Shelly Dimmer 1 (added a workaround due to not using semantic versioning in firmware version of the Shelly Dimmer 1)"
  },
  "3.0.29": {
    "en": "Code improvements for easier maintenance and a small fix for switching between color modes of the Shelly Bulb."
  },
  "3.0.30": {
    "en": "Code improvements for easier maintenance and a small fix for switching between color modes of the Shelly Bulb."
  },
  "3.0.31": {
    "en": "Code improvements for easier maintenance and a small fix for switching between color modes of the Shelly Bulb."
  },
  "3.0.32": {
    "en": "Small fix for devices appearing as offline while they are not."
  },
  "3.0.33": {
    "en": "Fix for Shelly 4 Pro appearing as offline."
  },
  "3.0.34": {
    "en": "Fix issue with dim values for RGBW2 White."
  },
  "3.0.35": {
    "en": "Fix issue with dim values for RGBW2 White."
  },
  "3.0.36": {
    "en": "Add ADC voltage for Shelly Uni and fix small issue with dimming being null for RGBW2."
  },
  "3.0.37": {
    "en": "Added user friendly names for events  in action event trigger cards and fixed an issue where Shelly Uni did not create a device for the second relay channel. Also renamed the temperature capability of Shelly Plug S to device temperature and remove obsolete input_1 capability of Shelly Button 1. Lastely deprecated the combined temperature and dim action card for the Shelly DUO as the can be achieved with two built in action cards."
  },
  "3.0.38": {
    "en": "Added user friendly names for events in action event trigger cards and fixed an issue where Shelly Uni did not create a device for the second relay channel. Also renamed the temperature capability of Shelly Plug S to device temperature and remove obsolete input_1 capability of Shelly Button 1. Lastely deprecated the combined temperature and dim action card for the Shelly DUO as the can be achieved with two built in action cards."
  },
  "3.0.39": {
    "en": "Added user friendly names for events in action event trigger cards and fixed an issue where Shelly Uni did not create a device for the second relay channel. Also renamed the temperature capability of Shelly Plug S to device temperature and remove obsolete input_1 capability of Shelly Button 1. Lastely deprecated the combined temperature and dim action card for the Shelly DUO as the can be achieved with two built in action cards."
  },
  "3.0.40": {
    "en": "Added an \"Input x Has Changed\" trigger card for devices with inputs. Also added user friendly names for events in action event trigger cards and fixed an issue where Shelly Uni did not create a device for the second relay channel. Also renamed the temperature capability of Shelly Plug S to device temperature and remove obsolete input_1 capability of Shelly Button 1. Lastely deprecated the combined temperature and dim action card for the Shelly DUO as the can be achieved with two built in action cards."
  },
  "3.0.41": {
    "en": "Added an \"Input x Has Changed\" trigger card for devices with inputs. Also added user friendly names for events in action event trigger cards and fixed an issue where Shelly Uni did not create a device for the second relay channel. Also renamed the temperature capability of Shelly Plug S to device temperature and remove obsolete input_1 capability of Shelly Button 1. Lastely deprecated the combined temperature and dim action card for the Shelly DUO as the can be achieved with two built in action cards."
  },
  "3.0.42": {
    "en": "Fix issue with action event trigger card not firing."
  },
  "3.0.43": {
    "en": "Added a workaround for firmware issue with auto discovery of Shelly motion sensor, also added the firmware check condition card and firmware update card for Shelly 1L. Removed the temperature and humidity capability for Shelly 1/1PM/1L if no external sensors are present and fixed issue with switching between color and temperature mode for Shelly RGBW2 Color."
  },
  "3.0.44": {
    "en": "Added a workaround for firmware issue with auto discovery of Shelly motion sensor, also added the firmware check condition card and firmware update card for Shelly 1L. Removed the temperature and humidity capability for Shelly 1/1PM/1L if no external sensors are present and fixed issue with switching between color and temperature mode for Shelly RGBW2 Color."
  },
  "3.0.45": {
    "en": "Fixed an error when setting dimmer to 0 brightness, also fixed an issue where flow cards where not showing up on the Shelly 1L. Added a possible fix for some RGBW2 devices returning a 404 error after the previous release and included some additional error handling for network communication errors."
  },
  "3.0.46": {
    "en": "Branding improvements and preparations for the upcoming Shelly4Pro. No functional changes in this release."
  },
  "3.0.47": {
    "en": "Branding improvements, no functional changes."
  },
  "3.0.48": {
    "en": "Fix for pairing the Shelly Motion Sensor."
  },
  "3.0.49": {
    "en": "Added support for the first generation Shelly Air, fix for updating the white mode capability when white channel from RGBW2 is changed and added better capability description for light_temperature for RGBW2 as it's used for setting the white channel instead of light temperature."
  },
  "3.0.50": {
    "en": "Minor branding improvements, no functional changes."
  },
  "3.0.51": {
    "en": "Possible fix for reading ADCS for Shelly Uni."
  },
  "3.1.0": {
    "en": "Breaking change: due to code clean up this update breaks the upgrade path for user still on Homey firmware 4.x and lower. If you still need to update your Homey to firmware 5.x or higher you will need to re-pair your devices to avoid issues. Other then code clean up there are no functional changes in this release."
  },
  "3.1.1": {
    "en": "Breaking change: due to code clean up this update breaks the upgrade path for user still on Homey firmware 4.x and lower. If you still need to update your Homey to firmware 5.x or higher you will need to re-pair your devices to avoid issues. Other then code clean up there are no functional changes in this release."
  },
  "3.1.2": {
    "en": "Breaking change: due to code clean up this update breaks the upgrade path for user still on Homey firmware 4.x and lower. If you still need to update your Homey to firmware 5.x or higher you will need to re-pair your devices to avoid issues. Other then code clean up there are no functional changes in this release. Also removed the already deprecated custom dim/temperature action card for the Shelly DUO, please use the built in actions cards for this."
  },
  "3.2.0": {
    "en": "Add support for the new Shelly Pro 4PM (uses websockets for communication). Also upgraded the shellies-coap library and some other minor improvements."
  },
  "3.3.0": {
    "en": "Added a generic firmware is available triggercard and deprecated the firmware available conditon card which is now obsolete. Please update your flows accordingly.. Deprecated the custom flipback switch 2 and flipback switch 4 action cards. These have become obsolete a long time ago, please update your flows to use the regular flipback switch card. Some other minor improvements in there as well."
  },
  "3.3.1": {
    "en": "Added a generic firmware is available triggercard and deprecated the firmware available conditon card which is now obsolete. Please update your flows accordingly.. Deprecated the custom flipback switch 2 and flipback switch 4 action cards. These have become obsolete a long time ago, please update your flows to use the regular flipback switch card. Some other minor improvements in there as well."
  },
  "3.3.2": {
    "en": "Added a generic firmware is available triggercard and deprecated the firmware available conditon card which is now obsolete. Please update your flows accordingly.. Deprecated the custom flipback switch 2 and flipback switch 4 action cards. These have become obsolete a long time ago, please update your flows to use the regular flipback switch card. Some other minor improvements in there as well."
  },
  "3.3.3": {
    "en": "Added a generic firmware is available triggercard and deprecated the firmware available conditon card which is now obsolete. Please update your flows accordingly. Deprecated the custom flipback switch 2 and flipback switch 4 action cards. These have become obsolete a long time ago, please update your flows to use the regular flipback switch card. Some other minor improvements in there as well."
  },
  "3.3.4": {
    "en": "Added a generic firmware is available triggercard and deprecated the firmware available conditon card which is now obsolete. Please update your flows accordingly. Deprecated the custom flipback switch 2 and flipback switch 4 action cards. These have become obsolete a long time ago, please update your flows to use the regular flipback switch card. Some other minor improvements in there as well."
  },
  "3.3.5": {
    "en": "Fixed an issue with device icons not displaying correctly."
  },
  "3.3.6": {
    "en": "Fixed an issue with device icons not displaying correctly."
  },
  "3.3.7": {
    "en": "Fixed an issue with the 2nd input of a multichannel devices updating incorrectly. Code improvements for the newly added support for Homey Cloud. "
  },
  "3.3.8": {
    "en": "Added support for the Shelly Button 1 on Homey Cloud. Also added dimming transition for the dimmer, RGBW2, Duo and Vintage on Homey Pro (limited to 5 seconds due to Shelly API limitations). And fixed a bug in the momentary flipback switch action card."
  },
  "3.4.0": {
    "en": "Fixed issue with dimming on Shelly Vintage. Possibly fixed an issue with the intelligent action for Shelly 2(.5) roller shutter. Added support for Door/Window, Motion, Flood, Humidity/Temperature and Smoke sensors on Homey Cloud."
  },
  "3.4.1": {
    "en": "Initial state of devices added to Homey Cloud is now updated. Removed some deprecated flow cards, make sure to fix your flows if you missed the previous announcements. "
  },
  "3.4.2": {
    "en": "Add support for Shelly Plus 1 and Shelly Plus 1PM next generation devices. Fixed a bug with the flipback switch for relay devices."
  },
  "3.4.3": {
    "en": "Added RSSI WiFi signal to all devices. Fixed an issue with action events for Shelly Plus devices after an API update. And fixed an issue with the flipback switch action card for multichannel devices."
  },
  "3.4.4": {
    "en": "Fixed an issue with the inputs for GEN1 devices with multiple channels. Fixed an issue with inputs for GEN2 (Plus) devices."
  },
  "3.4.5": {
    "en": "Fixed an issue with the inputs for GEN1 devices with multiple channels. Fixed an issue with inputs for GEN2 (Plus) devices."
  },
  "3.4.6": {
    "en": "Updated the Shelly Uni icon. Improved the dimming capability of the Shelly Dimmer, it not respects the transition time. Fixed a small issue with crashes on Homey Cloud."
  },
  "3.4.7": {
    "en": "Fixed an issue with switching channel 2-4 of the Shelly 4Pro Plus and added trigger cards for the input of the Shelly 4Pro Plus."
  },
  "3.4.8": {
    "en": "Fixed an issue with switching channel 2-4 of the Shelly 4Pro Plus and added trigger cards for the input of the Shelly 4Pro Plus."
  },
  "3.4.9": {
    "en": "Fix for meter power capability displaying in watt-hours instead of kWh on Shelly Plus devices."
  },
  "3.4.10": {
    "en": "Fix for meter power capability displaying in watt-hours instead of kWh on Shelly Plus devices."
  },
  "3.4.11": {
    "en": "Fix for incorrect calculation meter power capability on Shelly Plus devices."
  },
  "3.5.0": {
    "en": "Support for Shelly TRV, Shelly Pro 1, Shelly Pro 1PM, Shelly Pro 2 and Shelly Pro 2PM for local Homey has been added. Also the device temperature for Shelly 2.5 rollershutter has been added for local Homey. And the device overpowered trigger card has been deprecated. Please use the generic device error trigger card available on app level which now also reports overpower, overtemperature, overvoltage and overcurrent errors for Shelly Pro and Plus devices."
  },
  "3.5.1": {
    "en": "Support for Shelly TRV, Shelly Pro 1, Shelly Pro 1PM, Shelly Pro 2 and Shelly Pro 2PM for local Homey has been added. Also the device temperature for Shelly 2.5 rollershutter has been added for local Homey. And the device overpowered trigger card has been deprecated. Please use the generic device error trigger card available on app level which now also reports overpower, overtemperature, overvoltage and overcurrent errors for Shelly Pro and Plus devices."
  },
  "3.5.2": {
    "en": "Support for Shelly TRV for Homey local has been added. Also support for Shelly Pro 1, Shelly Pro 1PM, Shelly Pro 2 and Shelly Pro 2PM for local Homey and Homey Cloud has been added. Also the device temperature for Shelly 2.5 rollershutter has been added for local Homey. And the device overpowered trigger card has been deprecated. Please use the generic device error trigger card available on app level which now also reports overpower, overtemperature, overvoltage and overcurrent errors for Shelly Pro and Plus devices."
  },
  "3.5.3": {
    "en": "Use the user-configured profile names for Shelly TRV instead of default profile names for profile condition and action card. "
  },
  "3.5.4": {
    "en": "Small improvements. CoAP / CoIot is now disabled on gen1 devices when removed from Homey Pro. Users are given the option to manually pair their device in the scenario where some devices are not discovered over mDNS but others are but have already been paired. And better clean up running processes before the app is updated on Homey Cloud. "
  },
  "3.5.5": {
    "en": "This release fix a bug for devices not being discovered when pairing the first Shelly device with Homey and a bug where Shelly Plus devices can not be paired manually if needed."
  },
  "3.5.6": {
    "en": "Added a new action card for Shelly TRV to set the external measured temperature through a flow for Homey Pro. And finally fixed the 400 error when setting the position of blinds for the Shelly 2(.5) rollershutter for Homey Pro. Also fixed the parsing status updates for Gen2/Plus devices connected to Homey Cloud. Improved the error handling when setting dim duration for lights above 5 seconds which Shelly devices do not support for Homey Pro. Setting dim when light is off for the Duo, RGBW2 Color, RGBW2 White and Vintage now also turns on the light and sets the dim in a single action similar to the dimmer for Homey Pro and Homey. And permanently removed the overpowered trigger card. Itâ€™s been replaced by the generic device error trigger card available on app level."
  },
  "3.5.7": {
    "en": "This releases fixes an issue where the status of GEN2/Plus device connected to Homey Cloud is not updated. Also update some of the used frameworks due to security issues."
  },
  "3.5.8": {
    "en": "The release contains some small bug fixes."
  },
  "3.5.9": {
    "en": "This release contains a breaking change. If you recently paired any GEN2/Plus devices with Homy Cloud/Beta you will need to re-pair your devices to make sure it receives status updates. The release also adds support for Shelly Plus i4 for Homey Cloud. It also contains a possible fix for rollershutters not updating to the correct position when halfway setting is set."
  },
  "3.5.10": {
    "en": "This release attempts to fix the missing status updates for devices paired with Homey Beta/Cloud. It also adds all input flowcards for the Shellyi4 when paired with Homey Beta/Cloud."
  },
  "3.6.0": {
    "en": "This release contains breaking changes. The halfway setting from Shelly 2(.5) Roller Shutter has been removed due to ongoing issues with this functionality which is not part of the Shelly eco system. The already deprecated RGBW2 CWWW driver has been completely removed. The release also adds support for Shelly Pro 2 and Shelly Pro 2PM in roller shutter mode for Homey Pro."
  },
  "3.6.1": {
    "en": "This release contains breaking changes. The halfway setting from Shelly 2(.5) Roller Shutter has been removed due to ongoing issues with this functionality which is not part of the Shelly eco system. The already deprecated RGBW2 CWWW driver has been completely removed. The release also adds support for Shelly Pro 2 and Shelly Pro 2PM in roller shutter mode for Homey Pro."
  },
  "3.6.2": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.3": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.4": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.5": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.6": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.7": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.8": {
    "en": "This release adds support for Shelly Plus 2PM in relay and roller shutter mode for Homey Pro. It also contains some code refactoring."
  },
  "3.6.9": {
    "en": "This release adds support for Shelly Plus 2PM in relay mode for Homey Pro and Homey Cloud/Beta and in roller shutter mode for Homey Pro. It also fixes an issue with correct status updates for the inputs on Plus/Pro devices. And it contains code refactoring."
  },
  "3.6.10": {
    "en": "This release adds support for Shelly Plus 2PM in relay mode for Homey Pro and Homey Cloud/Beta and in roller shutter mode for Homey Pro. It also fixes an issue with correct status updates for the inputs on Plus/Pro devices. And it contains code refactoring."
  },
  "3.7.0": {
    "en": "This release contains a breaking change for Shelly Plus 1 and Shelly Plus 1PM devices. The devices need to be re-paired due to architectural changes in the app allowing for better maintenance. The release also adds support for Shelly Plus 2PM in relay mode for Homey Pro and Homey Cloud/Beta and in roller shutter mode for Homey Pro. It also fixes an issue with correct status updates for the inputs on Plus/Pro devices. And it contains code refactoring."
  },
  "3.7.1": {
    "en": "This release contains a breaking change for Shelly Plus 1 and Shelly Plus 1PM devices. The devices need to be re-paired due to architectural changes in the app allowing for better maintenance. The release also adds support for Shelly Plus 2PM in relay mode for Homey Pro and Homey Cloud/Beta and in roller shutter mode for Homey Pro. It also fixes an issue with correct status updates for the inputs on Plus/Pro devices. And it contains code refactoring."
  },
  "3.7.2": {
    "en": "This release contains a breaking change for Shelly Plus 1 and Shelly Plus 1PM devices. The devices need to be re-paired due to architectural changes in the app allowing for better maintenance. The release also adds support for Shelly Plus 2PM in relay mode for Homey Pro and Homey Cloud/Beta and in roller shutter mode for Homey Pro. It also fixes an issue with correct status updates for the inputs on Plus/Pro devices. And it contains code refactoring."
  },
  "3.7.3": {
    "en": "This release fixes some small issues. Push actions events for Shelly 1PM should be registered again on Homey Pro. Decimal numbers are allowed for manually setting the external temperature for the Shelly TRV on Homey Pro and the dimming of the Shelly RGBW2 should be working again on Homey Pro."
  },
  "3.8.0": {
    "en": "This release includes a breaking change for Homey Cloud / Beta users. The way Homey Beta/Cloud connected devices communicate with Shelly Cloud has changed, this requires you to remove and re-pair all your Homey Cloud / Beta connected Shelly devices. Sorry for the inconvenience but this is very much needed for future development. The release also adds all roller shutter devices for Homey Cloud / Beta. A firmware update action card for Shelly Plus/Pro devices for Homey Pro has been added. Some device icons for new Plus and Pro devices have been updated. And it contains lots and lots of code improvements."
  },
  "3.8.1": {
    "en": "This release includes a breaking change for Homey Cloud / Beta users. The way Homey Beta/Cloud connected devices communicate with Shelly Cloud has changed, this requires you to remove and re-pair all your Homey Cloud / Beta connected Shelly devices. Sorry for the inconvenience but this is very much needed for future development. The release also adds all roller shutter devices for Homey Cloud / Beta. A firmware update action card for Shelly Plus/Pro devices for Homey Pro has been added. Some device icons for new Plus and Pro devices have been updated. And it contains lots and lots of code improvements."
  },
  "3.9.0": {
    "en": "The release contains a breaking change. Action events for Plus/Pro devices have been updated to be able to add double push event. Due to this change you will need to update all flows using the generic action event trigger for Plus/Pro devices. The release also fixes action events of the Shelly i4 and manual pairing where auto discovery is not available."
  },
  "3.9.1": {
    "en": "The release contains a breaking change. Action events for Plus/Pro devices have been updated to be able to add double push event. Due to this change you will need to update all flows using the generic action event trigger for Plus/Pro devices. The release also fixes action events of the Shelly i4 and manual pairing where auto discovery is not available."
  },
  "3.9.2": {
    "en": "This release adds support for short- and long push events for Shelly 1 on Homey Pro and Homey Cloud and for button down and button up events for Plus and Pro devices on Homey Pro. It also contains some code improvements that caused log cluttering."
  },
  "3.9.3": {
    "en": "This release adds support for short- and long push events for Shelly 1 on Homey Pro and Homey Cloud and for button down and button up events for Plus and Pro devices on Homey Pro. It also contains some code improvements that caused log cluttering and fixes a bug with setting the dim level when a light is powered off for GEN1 devices on Homey Pro."
  },
  "3.9.4": {
    "en": "This release adds support for password authentication for Plus/Pro devices on Homey Pro. It also adds an action card for setting the eco mode of powered Shelly devices on Homey Pro and fixes an issue with the inputs for the Shelly i4."
  },
  "3.9.5": {
    "en": "This release adds a generic update all firmware action card for Homey Pro. It also fixes an issue with roller shutters on Homey Cloud and an issue with authentication for multichannel Plus/Pro devices on Homey Pro."
  },
  "3.9.6": {
    "en": "The release fixes the following issues. Fix for out of range errors for GEN1 roller shutter devices on Homey Pro and Homey Cloud. Fix for button events of Shelly Button 1 for Homey Cloud and fix for action events being triggered right after app update or directly after pairing a device on Homey Cloud."
  },
  "3.9.7": {
    "en": "Code improvements for upcoming Homey firmware 7.4.x. No functional changes."
  },
  "3.9.8": {
    "en": "Code improvements for upcoming Homey firmware 7.4.x. No functional changes."
  },
  "3.9.9": {
    "en": "This release fixes handling inputs on multichannel devices on Homey Cloud. It also fixes various capabilities being out of range on both Homey Pro and Homey Cloud. A there is some better error handling when connecting to Shelly Cloud for Homey Cloud."
  },
  "3.9.10": {
    "en": "Small bugfixes causing some devices to appear as offline after the latest release."
  },
  "3.9.11": {
    "en": "This release fixes two issues. There is a fix for multichannel Plus and Pro devices on Homey Cloud and Homey Pro and a fix for some devices appearing as offline due to an error in status updates on Homey Pro."
  },
  "3.9.12": {
    "en": "This release fixes the following bugs. Fix for a bug with the Shelly Motion sensor not updating on Homey Pro. Fix for a bug where battery operated devices would not come online after an app update for Homey Pro and Homey Cloud. And fix for a bug for setting the roller shutter position on Plus devices for Homey Pro."
  },
  "3.10.0": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. The release also adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.1": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. The release also adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.2": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.3": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.4": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.5": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.6": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.7": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.8": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.9": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.10": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.11": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.12": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.13": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.14": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements.\""
  },
  "3.10.15": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.10.16": {
    "en": "Important message: this release contains some non-breaking but fundamental changes. All previous device drivers have been deprecated for both Homey Pro and Homey Cloud. They have been replaced by a single unified driver for all Shelly devices. Your already paired devices will continu to function but new devices should be paired with this new driver. This will make adding future devices to the ever growing collection of Shelly devices a lot easier. See the support forum for further details. This release also adds support for the Motion 2 and Shelly Plus HT for Homey Pro and Homey Cloud. And it adds total energy consumption for Shelly 3EM for Homey Pro and Cloud, total power consumption for Shelly RGBW2 for Homey Pro and Cloud, includes a fix for Shelly TRV target temperature being out of bounds and causing an app crash and has some various minor code improvements."
  },
  "3.11.0": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers, please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release adds an action card for the Shelly EM and 3EM to change the energy cumulative behaviour. The default is true but this allows you to change it to false. It also contains other minor improvements."
  },
  "3.11.1": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with devices not responding on Homey Cloud in certain scenarios. It also adds an action card for the Shelly EM and 3EM to change the energy cumulative behaviour. The default is true but this allows you to change it to false. It also contains other minor improvements."
  },
  "3.11.2": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with devices not responding on Homey Cloud in certain scenarios. It also adds an action card for the Shelly EM and 3EM to change the energy cumulative behaviour. The default is true but this allows you to change it to false. It also contains other minor improvements."
  },
  "3.11.3": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with pairing devices on Homey Pro where it shows already paired devices from the old drivers. It also fixes an issue with the total enery returned capability of the 3EM and adds a triggercard for Total Meter Power for the 3EM."
  },
  "3.11.4": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with pairing devices on Homey Pro where it shows already paired devices from the old drivers. It also fixes an issue with the total enery returned capability of the 3EM and adds a triggercard for Total Meter Power for the 3EM."
  },
  "3.11.5": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release contains a fix for controlling the RGBW2 White on Homey Pro."
  },
  "3.11.6": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with status updates for multichannel devices on Homey Pro. It also contains some minor code improvements."
  },
  "3.11.7": {
    "en": "Upcoming breaking change: the next release will remove all old Plus/Pro drivers for both Homey Pro and Cloud. Please migrate to the new unified driver before updating to version 3.12.0 which will be released early september. This release fixes an issue with status updates for multichannel devices on Homey Pro. It also contains some minor code improvements."
  },
  "3.12.0": {
    "en": "Breaking change: This release removes the previously deprecated drivers for all Shelly Plus/Pro devices on Homey Pro and Homey Cloud. If you have missed or ignored previous communication about this, you will have to re-pair these devices with the new generic Shelly device driver. The release also contains some minor performance improvements and the support for specific hardware revisions of Pro devices."
  },
  "3.12.1": {
    "en": "This release fixes a bug where the Input Turned Off trigger card is not available for some gen1 devices that have not been paired yet with the new generic driver."
  },
  "3.12.2": {
    "en": "This release fixes an issue of not being able to select a device in the generic action event trigger card. "
  },
  "3.12.3": {
    "en": "This release fixes an issue with action events for recently paired Plus/Pro devices on Homey Pro. It also fixes an issue with Plus/Pro devices loosing connection on Homey Pro when authentication has been enabled."
  },
  "3.12.4": {
    "en": "This release fixes an issue with the Valve position changed trigger card not being available for the Shelly TRV when still paired with the deprecated driver. It also contains a code change in an attempt to fix a memory leak for users with multichannel devices."
  },
  "3.13.0": {
    "en": "Fix for action event trigger card showing an error when users has skipped major updates and broken the upgrade path for Homey Pro and Homey Cloud. Also some improvements in the cloud connection to better handle invalid oauth2 sessions for Homey Cloud. "
  },
  "3.13.1": {
    "en": "This release adds an action card for sending custom commands using the API documentation on Homey Pro. This is for advanced users only! It also adds functionality to automatically turn of a light when setting dim to 0 on Homey Pro and Homey Cloud. And it introduces a mechanism for updating the IP address for gen2 devices when an incoming status updates doest match the registered IP address of the Shelly device. You should still use static IP addresses for your devices though."
  },
  "3.13.2": {
    "en": "This release fixes an issue with Homey Cloud and devices not being updated. It also fixes an issue with setting dim and color on the RGBW2 for Homey Cloud. And it adds an action card for reseting the energy totals of the Shelly EM and Shelly 3EM on Homey Pro."
  },
  "3.14.0": {
    "en": "IMPORTANT: the current generic cloud driver for cloud connected devices is deprecated and replaced by a new generic cloud driver. There is an issue with the current generic cloud driver resulting in custom trigger cards not being available for devices paired with this driver. Unfortunately there is no way to resolve this programmatically. You are asked to re-pair your cloud connected devices on Homey Cloud. The deprecated driver will be removed early next year resulting in devices connected with this driver to fail. "
  },
  "3.14.1": {
    "en": "Support for the new Shelly PlusAddon on Homey Pro and Homey Cloud. Also updated the frameworks because of a security vulnerability."
  },
  "3.14.2": {
    "en": "Better error handling, no functional changes."
  },
  "3.15.0": {
    "en": "Add support for the Shelly Plus Wall Dimmer US for Homey Pro and Cloud."
  },
  "3.15.1": {
    "en": "Better error handling, no functional changes."
  },
  "3.15.2": {
    "en": "This release adds support for the Shelly Pro 3EM. It also fixes an issue for Shelly Plus 2PM with new hard revision not being visible in the pairing wizard on Homey Cloud. And there are small code improvements included."
  },
  "3.16.0": {
    "en": "Breaking change for Homey Cloud: the previously deprecated generic cloud driver has been removed as announced some time ago. Re-pair your devices if you havent already. This release also adds support for the Plus Plug S and Plus Smoke."
  },
  "3.16.1": {
    "en": "This release contains a fix for disabling the heating schedule for Shelly TRV on Homey Pro. It also contains a fix for button events for Shelly Button on Homey Cloud. And it includes some code refactoring for polling devices that have networking issues."
  },
  "3.16.2": {
    "en": "Fix issue with the app crashing after the previous release in certain use cases."
  },
  "3.16.3": {
    "en": "Fix issue with the app crashing after the previous release in certain use cases."
  },
  "3.16.4": {
    "en": "Fix issue with the app crashing after the previous release in certain use cases."
  },
  "3.16.5": {
    "en": "This release contains a fix for disabling the heating schedule for Shelly TRV on Homey Pro. It also contains a fix for button events for Shelly Button on Homey Cloud. It also reverts some code refactoring causing app crashes."
  },
  "3.17.0": {
    "en": "Code refactoring, no functional changes."
  },
  "3.17.1": {
    "en": "This release brings improvements to energy usage of the Shelly 3EM Pro. It also improves error handling during pairing of devices and points people to the pairing instructions. And it deprecates a action card for setting a color effect for the RGBW2. This card is replaced by a more generic action card which can also be used on the Shelly Bulb RGBW."
  },
  "3.17.2": {
    "en": "This release spreads the polling of devices a bit more as some Homeys seem to struggle with polling a lot of devices resulting in network errors. It also replaces an advanced setting for disabling CoAP with disabling polling. Changing this settings is not recommended and should only be used as a last resort."
  },
  "3.17.3": {
    "en": "This release adds the missing sensors for the gen2 Shelly AddOn module. It also fixes the pairing of a Shelly Plus 2PM in cover mode and adds a dim slider for the white level on the RGBW2. "
  },
  "3.17.4": {
    "en": "This release adds the missing sensors for the gen2 Shelly AddOn module. It also fixes the pairing of a Shelly Plus 2PM in cover mode and adds a dim slider for the white level on the RGBW2. As last it does not show devices as offline anymore after a certain amount a reconnects."
  },
  "3.18.0": {
    "en": "No functional changes but refactoring of the code that polls the devices for their status in an attempt to work around the issue where Homey shows devices as unreachable while they are online. "
  },
  "3.18.1": {
    "en": "No functional changes but refactoring of the code that polls the devices for their status in an attempt to work around the issue where Homey shows devices as unreachable while they are online."
  },
  "3.18.2": {
    "en": "No functional changes but refactoring of the code that polls the devices for their status in an attempt to work around the issue where Homey shows devices as unreachable while they are online."
  },
  "3.18.3": {
    "en": "This release contains a fix for pairing a Shelly Plus 2PM in cover mode on Homey Cloud and a fix for setting a custom image which broke some releases ago. The biggest change however is the refactoring of the code that polls the devices for their status in an attempt to work around the issue where Homey shows devices as unreachable while they are online."
  },
  "3.18.4": {
    "en": "This release fixes the the following issues. Fix for Total Power trigger card for 3EM on Homey Cloud. Fix setting roller shutter for x seconds action card on Homey Cloud. And a fix for total power and total power returned displayed in Wh instead of kWh."
  },
  "3.18.5": {
    "en": "This release fixes an issue with the total power capability of 3EM not updating on Homey Cloud. It also includes some framework updates for fixes security vulnerabilities."
  },
  "3.18.6": {
    "en": "This release contains a fix for inconsistent measure and meter power capabilities on the Shelly 3EM and Shelly Pro 3EM. This fix requires you to re-pair the device if you are affected by this bug."
  },
  "3.18.7": {
    "en": "This release fixes inconsistent measure and meter power capabilities on the Shelly 3EM. This fix requires you to re-pair the device if you are affected by this bug. It also changes the device class of the TRV from heater to themostat, flows depending on the device class will need to be updated."
  },
  "3.19.0": {
    "en": "This release adds support for Shelly Blu Button 1 and Shelly Blu DW on Homey Cloud and Homey Pro. Read the instructions on the forum on how to pair. The release also removes the deprecated drivers for Homey Cloud of battery operated devices. If you havent already you will need to re-pair them using the new generic driver."
  },
  "3.19.1": {
    "en": "This release improves the behaviour of Shelly BLU devices paired with Homey Pro or Homey Cloud."
  },
  "3.20.0": {
    "en": "This release adds support for the Shelly Wall Display and Shelly Pro Dual Cover."
  },
  "3.20.1": {
    "en": "This release fixes an issue for devices with inputs on Homey Cloud."
  },
  "3.20.2": {
    "en": "This release contains some small fixes for the beacon mode of the Shelly BLU Button."
  },
  "3.20.3": {
    "en": "This release fixes an issue with the action event triggercard for action events of Plus/Pro devices with multiple channels."
  },
  "3.20.4": {
    "en": "This release fixes an issue with action events for the Shelly i4 introduced with the previous release. It also fixes an issue with the beacon mode on Shelly BLU devices including the related triggercards."
  },
  "3.21.0": {
    "en": "Add support for the Shelly Wave 1 and basis support for the Shelly Wave 1PM (currently without power/energy measurement)."
  },
  "3.21.1": {
    "en": "This release fixes an issue with the beacon mode of BLU devices and it adds the names for the 4th and 5th add-on connected external temperature sensor. "
  },
  "3.21.2": {
    "en": "This release adds support for the Shelly Pro EM-50, Plus Mini, Plus 1 Mini, Plus 1PM Mini and the Shelly Blu Motion. It also adds untested support for the Shelly Wave 2PM excluding the energy capabilities (as this requires Athom to fix the zwave driver first)."
  },
  "3.21.3": {
    "en": "Enable support for the Shelly Wave 2PM."
  },
  "3.21.4": {
    "en": "This release adds support for the BLU Gateway and it adds an action card for devices with the meter power capability which allows it to set as cumulative. It fixes an issue with the upgrade firmware card for Plus/Pro devices by adding an extra firmware availability check. And it adds proper device icons for the BLU DW, BLU Motion, Pro 4PM, Pro Dual Cover and Wall Display."
  },
  "3.21.5": {
    "en": "This release adds support for the Shelly Wave Shutter. It also fixes power/energy readings on Shelly Wave PM devices (credits to Caseda) and  incorrect energy reading on Plus/Pro devices with multiple channels."
  },
  "3.21.6": {
    "en": "This release adds support for external voltmeter using the Shelly Sensor Add-on. It also fixes zwave parameters not being saved for Shelly Wave devices, the pairing of Shelly Plus Plug US devices and a small issue with the Shelly Wave Shutter in venetian blinds operating mode."
  },
  "3.21.7": {
    "en": "This release adds support for external voltmeter using the Shelly Sensor Add-on. It also fixes zwave parameters not being saved for Shelly Wave devices, the pairing of Shelly Plus Plug US devices and a small issue with the Shelly Wave Shutter in venetian blinds operating mode."
  },
  "3.22.0": {
    "en": "This release contains a breaking change! All device specific drivers voor Homey Cloud have been removed. They have been deprecated for more than a year now and have now been completely removed. If you are still using the deprecated driver you are now required to re-pair your devices using the generic driver. The release also adds logic which checks the communication configuration of devices upon device initialization and fixes any issues, for instance when Homeyâ€™s IP address was changed after pairing the Shelly device. And it contains improved error reporting for users that do not read and follow the pairing instructions. The app now also removes input capabilities for Plus/Pro devices that have the input configured as button. Buttons donâ€™t have a state and the input capability serves no function. And at last, it removes the ability to disable CoAP updates from the app settings. This setting serves no purpose anymore after a memory leak has been fixed some time back and it confuses less tech savvy users."
  },
  "3.22.1": {
    "en": "This release contains a fix for a bug for handling action events for the Shelly i4 which was introduced with the latest release. It also contains a fix for external analog inputs with the Shelly Sensor Add-on not working."
  },
  "3.22.2": {
    "en": "This release adds support for the Shelly Plus 0-10V Dimmer. It also fixes a bug with action events of Plus/Pro devices that can also be configured as a roller shutter."
  },
  "3.22.3": {
    "en": "This release fixes an issue with inputs not being available on multichannel devices with mixed button / switch configuration."
  },
  "3.22.4": {
    "en": "This release fixes an issue with inputs not being available on multichannel devices with mixed button / switch configuration. It also includes a possible fix for the Wave Shutter in venetian blinds mode where the tilt of the slats can not be set separately. It also changes the device class of the Shelly Plus 0-10V Dimmer to socket for more flexibility and fixes a translation issue with triple push for Shelly i4."
  },
  "3.22.5": {
    "en": "This release changes the reconnect timings to Shelly Cloud allowing for longer registered disconnection before terminating and reestablishing the connection as this currently fails anyway due to an issue in Homeyâ€™s OAuth2 module. It also adds a trigger card for Homey Cloud that detects when there is a connection issue. It also fixes an issue with saving Zwave parameters of Shelly Wave devices."
  },
  "3.22.6": {
    "en": "This release changes the reconnect timings to Shelly Cloud allowing for longer registered disconnection before terminating and reestablishing the connection as this currently fails anyway due to an issue in Homey's OAuth2 module. It also adds a trigger card for Homey Cloud that detects when there is a connection issue. And it fixes an issue with saving Zwave parameters of Shelly Wave devices as well as incorrect parsing of energy values for the Pro 3EM when outbound websockets is not operational."
  },
  "3.22.7": {
    "en": "This release changes the reconnect timings to Shelly Cloud allowing for longer registered disconnection before terminating and reestablishing the connection as this currently fails anyway due to an issue in Homey's OAuth2 module. It also adds a trigger card for Homey Cloud that detects when there is a connection issue. And it fixes an issue with saving Zwave parameters of Shelly Wave devices as well as incorrect parsing of energy values for the Pro 3EM when outbound websockets is not operational."
  },
  "3.22.8": {
    "en": "This release contains a fix for the app crashing on Homey Cloud in some scenarios."
  },
  "3.23.0": {
    "en": "This release reverts some changes trying to work around a reconnect issue with Homey Cloud as itâ€™s causing app crashes for some users. It also adds a maintenance action for resetting the energy meter on Shelly Wave devices with energy meter capabilities and a maintenance action for for calibrating a Shelly Wave Shutter."
  },
  "3.23.1": {
    "en": "This release reverts some changes trying to work around a reconnect issue with Homey Cloud as itâ€™s causing app crashes for some users. It also adds a maintenance action for resetting the energy meter on Shelly Wave devices with energy meter capabilities and a maintenance action for for calibrating a Shelly Wave Shutter."
  },
  "3.23.2": {
    "en": "This release makes changes to how devices are controlled using Homey Cloud. There was a change in the Shelly Cloud API and an bug in the Shelly Cloud documentation resulting in devices not being controllable over Homey Cloud. This release also reverts some changes trying to work around a reconnect issue with Homey Cloud as it's causing app crashes for some users. It also adds a maintenance action for resetting the energy meter on Shelly Wave devices with energy meter capabilities and a maintenance action for for calibrating a Shelly Wave Shutter."
  },
  "3.23.3": {
    "en": "This release restores the cloud reconnect improvements and cloud reconnection error trigger card as this was not the cause of recent cloud connectivity issues. And the generic device error trigger card now also works on Homey Cloud for devices that can not be reached by Shelly Cloud."
  },
  "3.23.4": {
    "en": "Breaking change. This release contains a fix for Homey Firmware 10.1.0 breaking the energy monitoring of Shelly Wave devices. This fix is not backwards compatible however. You will need to update to firmware 10.1.0. It also includes improvements for Homey Cloud preventing the app from crashing in certain scenarios."
  },
  "3.23.5": {
    "en": "This release adds functionality to mark Shelly devices that are paired with Homey Cloud as offline upon app initialization if they are marked as offline by Shelly Cloud. It also adds more improvements to work around the known Homey Cloud reconnection issue cause by a bug in Homey code."
  },
  "3.23.6": {
    "en": "This release adds functionality to mark Shelly devices that are paired with Homey Cloud as offline upon app initialization if they are marked as offline by Shelly Cloud. It also adds more improvements related to the Homey Cloud reconnection issue where the connection is not restored after a disconnect."
  },
  "3.23.7": {
    "en": "This release adds functionality to mark Shelly devices that are paired with Homey Cloud as offline upon app initialization if they are marked as offline by Shelly Cloud. It also adds more improvements related to the Homey Cloud reconnection issue where the connection is not restored after a disconnect."
  },
  "3.23.8": {
    "en": "This release update the node-homey-zwavedriver as Athom seems to have fixed the issue with resetting the energy meter on Wave devices. It also adds an action card for dimming the white channel on a RGBW2 and includes a possible fix for being able to control the Wave Shutter with up/down/stop buttons instead of a slider. And some minor changes like fixing a couple of type-oâ€™s in dutch translation of Zwave parameters and adding learning mode instructions to Wave devices."
  },
  "3.24.0": {
    "en": "This release removes the measure_power and meter_power capability of the main node for the Shelly Wave 2PM. This requires you to re-pair the device. It also adds button action events for Plus/Pro devices configured as windowcoverings and adds support for the Wall Display in thermostat mode and Shelly Pro 3EM Add On. It includes another attempt to get the windowcoverings_state capability working with the Wave Shutter. And it adds proper naming of the sensors added to the Shelly Plus 2PM through the sensor add-on (requires re-pairing)."
  },
  "3.24.1": {
    "en": "This release fixes an issue with the onoff capability listener for Shelly Pro 3EM add on. It fixes an issue with button events not triggering on multi input devices on Homey Cloud. It changes the device class of the Dimmer 0-10V to light to fix the onoff capability. It fixes a type-o to show correct unit (W) on the token of the total power has changed trigger card. It fixes an issue with for Plus/Pro roller shutters not being able to pair and it has a fix for reversed behaviour of dimming the white channel on a Shelly RGBW2."
  },
  "3.24.2": {
    "en": "This release removes capability windowcoverings_state (up/down/stop) of Wave Shutter as itâ€™s not allowed to implement it next to the windowcoverings_set capability. It also fixes an issue with inverted light temperature on RGBW2, an issue with crashing app on Homey Cloud when Shelly credentials are incorrect and an issue with with incorrect label of returned energy on multichannel Plus/Pro devices."
  },
  "3.24.3": {
    "en": "This release removes capability windowcoverings_state (up/down/stop) of Wave Shutter as itâ€™s not allowed to implement it next to the windowcoverings_set capability. It also fixes an issue with inverted light temperature on RGBW2, an issue with crashing app on Homey Cloud when Shelly credentials are incorrect and an issue with with incorrect label of returned energy on multichannel Plus/Pro devices."
  },
  "3.25.0": {
    "en": "Important change: the generic â€œaction eventâ€ trigger card has been replaced by device specific â€œaction eventâ€ trigger cards. Currently the generic action card is deprecated but still works. But after some months it will be completely removed and will break your flows. So update your flows to prevent this from happening. For more information on this, see the topic on the support forum. This release also adds support for setting values of, and triggering flows based on changed values of virtual components from Shelly Gen3 devices. And it adds an action card for Shelly Plus Plug S for setting color and brightness of device LED ring. Under the hood it adds some logic to add missing capabilities upon device initialization."
  },
  "3.25.1": {
    "en": "This release fixes the device specific action event card not being available on battery operated devices and cloud devices even though they support action events. It also includes an improvement for not updating the CoIoT peer setting for gen1 devices that have been manually configured as mcast devices after pairing them with Homey."
  },
  "3.26.0": {
    "en": "This release adds support for the Shelly Wave Plug, Wave Pro 1, Wave Pro1PM, Wave Pro 2 and Wave Pro 2PM. It also includes a fix for the new device specific action event card triggering the wrong channel on multichannel devices on Homey Pro. It also adds proper naming for returned energy capability on Shelly Plus PM Mini. This requires re-pairing. And it removes duplicate capability for setting the white channel on RGBW2. It also removes the deprecated drives of Shelly Vintage, Smoke, Gas, Flood and Air to reduce the app footprint. Re-pair these devices with the generic driver if you where still using these deprecated drivers."
  },
  "3.26.1": {
    "en": "This release contains a fix for incorrectly added meter_power capability to devices with the pm:1 component like the new PM Mini devices. It also contains a fix for external temp sensors on Shelly Uni being added to both channels and not updating correctly. And it adds total and last minute counts capabilities for pulsecounter on Shelly Plus Uni. The release also reduces the need for repairing by adding more logic to the device init process allowing to dynamically update capability options like renaming of capabilities."
  },
  "3.27.0": {
    "en": "This release contains a breaking change for various deprecated device drivers with inputs. Trigger cards for the inputs for these drivers have been removed. If you still havent switched to the generic device driver and depend on these trigger card now is the time re-pair your device. It also contains a breaking change for RGBW2 Color, the light_temperature capability for setting the dim level of the white channel is replaced by a dim capability as the implementation is quite quirky and this makes more sense. You will need to fix your flows. It also adds the device specific action event card to the Shelly RGBW2 in color mode as it was missing and fixes onoff.white mode for RGBW2 on Homey Cloud. There is a fix in here for the firmware available card triggering every minute when a new firmware becomes available for Shelly Plus/Pro devices."
  },
  "3.27.1": {
    "en": "This release contains a breaking change for various deprecated device drivers with inputs. Trigger cards for the inputs for these drivers have been removed. If you still havent switched to the generic device driver and depend on these trigger card now is the time re-pair your device. It also contains a breaking change for RGBW2 Color, the light_temperature capability for setting the dim level of the white channel is replaced by a dim capability as the implementation is quite quirky and this makes more sense. You will need to fix your flows. It also adds the device specific action event card to the Shelly RGBW2 in color mode as it was missing and fixes onoff.white mode for RGBW2 on Homey Cloud. There is a fix in here for the firmware available card triggering every minute when a new firmware becomes available for Shelly Plus/Pro devices."
  },
  "3.27.2": {
    "en": "This release contains a breaking change for various deprecated device drivers with inputs. Trigger cards for the inputs for these drivers have been removed. If you still havent switched to the generic device driver and depend on these trigger card now is the time re-pair your device. It also contains a breaking change for RGBW2 Color, the light_temperature capability for setting the dim level of the white channel is replaced by a dim capability as the implementation is quite quirky and this makes more sense. You will need to fix your flows. It also adds the device specific action event card to the Shelly RGBW2 in color mode as it was missing and fixes onoff.white mode for RGBW2 on Homey Cloud. There is a fix in here for the firmware available card triggering every minute when a new firmware becomes available for Shelly Plus/Pro devices."
  },
  "3.27.3": {
    "en": "This release contains a breaking change for various deprecated device drivers with inputs. Trigger cards for the inputs for these drivers have been removed. If you still havent switched to the generic device driver and depend on these trigger card now is the time re-pair your device. It also contains a breaking change for RGBW2 Color, the light_temperature capability for setting the dim level of the white channel is replaced by a dim capability as the implementation is quite quirky and this makes more sense. You will need to fix your flows. It also adds the device specific action event card to the Shelly RGBW2 in color mode as it was missing and fixes onoff.white mode for RGBW2 on Homey Cloud. There is a fix in here for the firmware available card triggering every minute when a new firmware becomes available for Shelly Plus/Pro devices. And it includes some fixes that where introduced with the previous 3.27.x releases. "
  },
  "3.27.4": {
    "en": "Fix for the BLE Proxy script not being set to auto start after adding it from a Plus/Pro device."
  },
  "3.27.5": {
    "en": "This release changed the behaviour of the windowcoverings_state for Plus/Pro devices where opened or closed is now set as idle. This better matches the way it works for gen1 devices. It also fixes an issue with external humidity sensors on Plus/Pro devices for Homey Cloud, an issue for not being able to add a Shelly Pro 3EM and an issue where devices that have been paired long ago show up in the discovery wizard even though already paired due to changes in Shelly firmware with mDNS discovery."
  },
  "3.28.0": {
    "en": "Upcoming breaking change: the next major release will remove all drivers that have been deprecated for almost two years. Devices still using these drivers (these show a notification under the device) need to be re-paired. Your timeline will now also show the Shelly devices still using a deprecated driver. This release adds functionality where a newly paired Pro 3EM will show as one device if the profile is set to triphase. This device will have the totals of the three phases as primary energy capabilities. It also fixes the current and total current showing incorrect readings for the Pro 3EM. This release now really changes the behavior of the windowcoverings_state for Plus/Pro devices where opened or closed is now set as idle. And it fixes an issue where a RGBW2 in white mode would have hue and saturation capabilities. At last it includes framework updates."
  },
  "3.28.1": {
    "en": "Upcoming breaking change: the next major release will remove all drivers that have been deprecated for almost two years. Devices still using these drivers (these show a notification under the device) need to be re-paired. Your timeline will now also show the Shelly devices still using a deprecated driver. This release adds functionality where a newly paired Pro 3EM will show as one device if the profile is set to triphase. This device will have the totals of the three phases as primary energy capabilities. It also fixes the current and total current showing incorrect readings for the Pro 3EM. This release now really changes the behavior of the windowcoverings_state for Plus/Pro devices where opened or closed is now set as idle. And it fixes an issue where a RGBW2 in white mode would have hue and saturation capabilities. At last it includes framework updates."
  },
  "3.28.2": {
    "en": "Upcoming breaking change: the next major release will remove all drivers that have been deprecated for almost two years. Devices still using these drivers (these show a notification under the device) need to be re-paired. Your timeline will now also show the Shelly devices still using a deprecated driver. This release fixes the inputs on the Shelly Wave i4 (requires firmware 11.x)."
  },
  "3.29.0": {
    "en": "Breaking change: this release disables status updates for devices that are still using drivers that have been deprecated for almost two years. Disabling status updates is the first step in completely removing these drivers from the app. If you have ignored all previous warnings your timeline will show the Shelly devices which are affected and need to be re-paired asap."
  },
  "3.29.1": {
    "en": "Breaking change: this release removes the deprecated drivers of all gen1 lights and battery powered sensors. If you have ignored all previous warnings devices paired with these drivers will stop working and need to be removed and paired again. This release also changes the behaviour of the Shelly Wave i4. Using it in venetian blinds mode doesnt require re-pairing anymore. The tilt capability for the slats should become available based on your configuration."
  },
  "3.29.2": {
    "en": "Breaking change: this release removes the deprecated drivers of all gen1 lights and battery powered sensors. If you have ignored all previous warnings devices paired with these drivers will stop working and need to be removed and paired again. This release also changes the behaviour of the Shelly Wave Shutter. Using it in venetian blinds mode doesnt require re-pairing anymore. The tilt capability for the slats should become available based on your configuration."
  },
  "3.29.3": {
    "en": "Breaking change: this release removes the deprecated drivers of all gen1 lights and battery powered sensors. If you have ignored all previous warnings devices paired with these drivers will stop working and need to be removed and paired again. This release also changes the behaviour of the Shelly Wave Shutter. Using it in venetian blinds mode doesnt require re-pairing anymore. The tilt capability for the slats should become available based on your configuration."
  },
  "3.29.4": {
    "en": "Breaking change: this release removes all previously deprecated drivers. If you have ignored all previous warnings the devices paired with these drivers will stop working and need to be removed and paired again. This release also fixes an issue with pairing the Shelly Wave PM Mini, an issue with temperature and humidity readings of the Shelly BLU HT, an issue with external temperature sensors from the plus addon not updating near real time and an issue with not being able to pair gen3 devices which have authentication enabled."
  },
  "3.29.5": {
    "en": "This release fixes an issue with values not updating for the Wave Shutter. Due to a bug in Homey you will need to remove and re-add association group 1 to value 1.1. It also add a flow card for setting the tilt position of the Wave Shutter in venetian blinds mode. The release also fixes an issue with pairing discontinued devices that have older firmware and do not support unicast CoAP like to old Shelly 4 Pro."
  },
  "3.30.0": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.1": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.2": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.3": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.4": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.5": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.6": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  },
  "3.30.7": {
    "en": "This release adds support for Shelly 1 Gen3, 1PM Gen3, i4 Gen3, Wave Pro Shutter, Wave Pro 3 and BLU Wall Switch 4 and it fixes an issue with manual pairing a Shelly RGBW2 in white mode."
  }
}
