{
  "1.13.3": {
    "en": "Moved installation instructions from app store to community support topic."
  },
  "1.14.0": {
    "en": "Added support for Shelly Dimmer/SL (thx to domotica-shop.nl for supplying the device)"
  },
  "1.14.1": {
    "en": "Skip the login credentials screen during pairing for devices that do not have authentication set up."
  },
  "1.14.2": {
    "en": "Fixed issue with pairing introduced with previous version (1.14.1)."
  },
  "1.15.0": {
    "en": "Added support for the Shelly Door Window Sensor."
  },
  "1.16.0": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience."
  },
  "1.16.1": {
    "en": "BREAKING CHANGES: complete overhaul of the Shelly 2 Relay and Shelly 4 Pro drivers to split them into seperate devices for each channel without polling the device for each channel. This will break current support for these drivers. You will need to re-pair your devices and fix your flows. Sorry for any inconvenience. Also added support for the temperature add-on for the Shelly 1 and Shelly 1PM."
  },
  "1.16.2": {
    "en": "Small fixes for Shelly 2 and Shelly 4 Pro."
  },
  "1.16.3": {
    "en": "Added new driver for Shelly 2.5 Rollershutter, you can re-pair it if you have paired as Shelly 2(.5) Rollershutter. Fixed an issue where devices from another type could show up in the pairing wizard. Small improvement to the pairing wizard which might resolve blank screens and timeouts. Added a new trigger card for Shelly 1 and Shelly1PM which can be triggered using the callback URLs. These need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions."
  },
  "1.17.0": {
    "en": "BREAKING CHANGES SHELLY EM: the Shelly EM driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your Shelly EM. Sorry for the inconvenience. Als support for the new Shelly 3EM has been added with the release."
  },
  "1.17.1": {
    "en": "Small fix for discovery of Shelly 3EM."
  },
  "1.17.2": {
    "en": "BREAKING CHANGES Shelly 2.5 Relay: The Shelly 2.5 Relay driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Also other small fixes and improvements."
  },
  "1.17.3": {
    "en": "BREAKING CHANGES RGBW2 4xWHITE: The RGBW2 4xWhite driver has been refactored to avoid double polling. This breaks the current support for these devices and requires you to re-pair your device. Sorry for the inconvenience. Added a toggle button for the RGBW2 Color to switch between white and color mode. Added trigger cards for the Shelly Dimmer to trigger flows based on input 1 and 2."
  },
  "1.17.4": {
    "en": "Fixes for trigger cards that may also cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.5": {
    "en": "Fixes for trigger cards and missing capabilities for paired devices that may cause some devices to appear as offline (like the Shelly Dimmer)."
  },
  "1.17.6": {
    "en": "Fix issue with incorrect readings for meter_power and meter_power_wmin capabilities for Shelly 2.5"
  },
  "1.17.7": {
    "en": "Fixed a bug in the callback trigger card for Shelly1PM. Added the callback trigger card functionality for the Dimmer, Shelly2, Shelly2.5, Plug, Plug-S, ShellyEM and Shelly3EM. These callback URLs need to be set using maintenance actions under the device settings. See the app description on the forum for further instructions. "
  },
  "1.18.0": {
    "en": "Added support for Shelly Duo and Shelly Vintage."
  }
}
