{
  "pair": {
    "title": "Add Shelly device",
    "nosettings": "Please fill in all the required fields.",
    "intro": "Enter the IP address and, if configured, your username and password for your Shelly device.",
    "intro-relay": "Pair your Shelly2(.5) device as a device with two relay buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "intro-rollershutter": "Pair your Shelly2(.5) device as a device with two roller shuttter buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "address": "IP Address",
    "username": "Username",
    "password": "Password",
    "single": "Use as single device",
    "polling": "Polling Frequency",
    "hostname": "Shelly Hostname:",
    "device": "Shelly Device:",
    "deviceid": "Shelly Device ID:",
    "type": "Shelly Device Type:",
    "test" : "Test Connection",
    "testing" : "Connection test succesfull, you can now connect the Shelly device.",
    "connect": "Connect",
    "success": "Shelly device added succesfully",
    "startpairing": "First pair the device with the Shelly smartphone app. Then press the physical button on your Shelly sensor or remove and re-insert the battery to wake up the device. The LED inside the sensor stops blinking once it has connected to your WiFi and is then ready for pairing. Then you can click the next button below.",
    "startpairingbutton": "First pair the device with the Shelly smartphone app. Connect a USB cable to the button to ensure it's powered and connected with your WiFi before continuing.",
    "startpairingmotion": "First pair the device with the Shelly smartphone app. From the webinterface reboot your Shelly Motion Sensor and continu this pairing wizard directly after the sensor has rebooted.",
    "titleselection": "What do you want to do?",
    "nodevices": "No devices have been discovered. You can try again or use manual pairing if you know the IP address of your Shelly device.",
    "again": "Try Again",
    "manual": "Manual Pairing",
    "title_icon_select": "Select icon",
    "intro_upload": "If you wish to use a custom icon for your device you can upload it here. The icon needs to be in .svg format.",
    "default_icon": "Use default",
    "save": "Save",
    "intro_vintage_icon": "Select which icon you want to use for your Shelly Vintage.",
    "title_cloud_pairing": "Pair Shelly over the cloud",
    "instructions_cloud_pairing": "You are about to pair a Shelly device over the cloud. Please follow these steps:",
    "instructions_cloud_pairing_step_1": "Visit the Shelly Integrator Portal using this",
    "instructions_cloud_pairing_step_2": "Log into this portal with your Shelly cloud credentials.",
    "instructions_cloud_pairing_step_3": "Find the device you wish to pair making sure it's of the same model which you are currently pairing in Homey (if your device is not listed here you will have to enable the cloud connection through the device webinterface of the Shelly smartphone app first).",
    "instructions_cloud_pairing_step_4": "In the Shelly Integrator Portal click the device you wish to pair and enable the cloud integrator and control settings for that device.",
    "instructions_cloud_pairing_step_5": "Click save in the Shelly Integrator Portal and afterwards click the test connection button in this pairing wizard.",
    "instructions_cloud_pairing_step_6": "If you see the correct device ID shown below you can click the next button to continu pairing the device.",
    "no_integrator_url": "Unable to create Shelly Integrator Portal URL."
  },
  "util": {
    "400": "Error 400: invalid API request, please send a diagnostic report from the app settings to the developer to help solve this issue.",
    "401": "Error 401: user credentials are missing or this user is not authorized, make sure you have copied the correct user credentials as entered in the Shelly smartphone app or Webinterface.",
    "502": "Timeout error: make sure you have entered the correct IP address and that the Shelly device is online.",
    "500": "Error 500: internal server error",
    "unknownerror": "Unknown error, are you sure you have entered the correct IP address and Homey is on the same network as the Shelly device? Please check your settings and try again.",
    "any_device": "With Any Device",
    "any_action": "With Any Action"
  },
  "connect": {
    "intro": "Using the Shelly RGBW2 in CW/WW mode enables you to connect 2 LED strips as follows:",
    "single": "If you only attach one LED strip or you want to always keep the two channels in sync, you should check 'Use as single device'.",
    "device-type": "Set the Device Type in the Shelly app to 'Color'",
    "strip1": "Strip 1: CW pin to R terminal, WW pin to G terminal",
    "strip2": "Strip 2: CW pin to B terminal, WW pin to W terminal",
    "warning": "With this setup, controlling the LED strips with the Shelly apps is not practical."
  },
  "device": {
    "unreachable": "Device is unreachable: "
  },
  "driver": {
    "wrongdevice": "The Shelly device you are trying to pair does not match with the selected Shelly device in the pairing wizard."
  },
  "settings": {
    "title": "Shelly Settings",
    "general": "General Settings",
    "intro-coap": "Disabling this will stop the CoAP listener and switch to HTTP polling. This can be useful on some networks where CoAP isnt working. Beware that device updates will be slower and that this also disables the action events (like short push etc). Please restart the app or Homey after changing this setting for it to take effect.",
    "coap": "Disable CoAP?",
    "polling": "Polling frequency in seconds",
    "success": "Settings have been saved succesfully.",
    "save": "Save"
  },
  "app": {
    "no_pairing_device_found": "No device for pairing found, make sure you follow the steps above."
  }
}
