{
  "pair": {
    "title": "Shelly Gerät hinzufügen",
    "nosettings": "Bitte füllen Sie alle erforderlichen Felder aus.",
    "intro": "Geben Sie die IP-Adresse und, falls konfiguriert, Ihren Benutzernamen und Ihr Passwort für Ihr Shelly Gerät ein.",
    "intro-relay": "Binden Sie Ihr Shelly2(.5) Gerät als Gerät mit zwei Relaisschaltern an (dies kann in der Shelly Smartphone-App konfiguriert werden). Geben Sie die IP-Adresse und, falls konfiguriert, Ihren Benutzernamen und Ihr Passwort für Ihr Shelly 2 Gerät ein.",
    "intro-rollershutter": "Binden Sie Ihr Shelly2(.5) Gerät als Gerät mit zwei Rollladen-Schalter (dies kann in der Shelly Smartphone-App konfiguriert werden). Geben Sie die IP-Adresse und, falls konfiguriert, Ihren Benutzernamen und Ihr Passwort für Ihr Shelly 2 Gerät ein.",
    "address": "IP-Adresse",
    "username": "Benutzername",
    "password": "Passwort",
    "single": "Als einzelnes Gerät verwenden",
    "polling": "Polling-Frequenz",
    "hostname": "Shelly Hostname:",
    "device": "Shelly Gerät:",
    "deviceid": "Shelly Gerät-ID:",
    "type": "Shelly Gerätetyp:",
    "test" : "Verbindung testen",
    "testing" : "Verbindungstest erfolgreich, Sie können jetzt das Shelly Gerät verbinden.",
    "connect": "Verbinden",
    "success": "Shelly Gerät erfolgreich hinzugefügt",
    "no_device_config": "Keine geeignete Gerätekonfiguration gefunden. Dieses Gerät wird möglicherweise noch nicht unterstützt, bitte melden Sie dies dem Entwickler.",
    "startpairingshelly": "Verwenden Sie diesen Pairing-Assistenten, um jedes Shelly WiFi Gerät zu pairn. Stellen Sie sicher, dass Ihre Shelly-Geräte mit Ihrem Wi-Fi verbunden sind, bevor Sie fortfahren. Sie können dies über die Shelly Smartphone-App tun. Wenn Sie ein batteriebetriebenes Gerät pairn möchten, wecken Sie es durch Drücken des Wake-Up-Knopfs auf oder verbinden Sie es mit USB-Strom. Wenn Sie beim Pairing von Geräten mit Homey Probleme haben, überprüfen Sie Ihre Netzwerkeinstellungen, starten Sie das Gerät neu und versuchen Sie es erneut.",
    "startpairingshellybluetooth": "Verwenden Sie diesen Pairing-Assistenten, um jedes Shelly Bluetooth (BLU) Gerät zu koppeln. Bitte beachten Sie, dass für ein Shelly BLU-Gerät, um mit Homey zu funktionieren, auch ein Bluetooth-Proxy auf mindestens einem Plus/Pro-Gerät in Ihrem Netzwerk aktiviert werden muss. Die Schaltfläche zur Aktivierung finden Sie in Homey unter den Geräteeinstellungen eines verbundenen Plus/Pro-Geräts. Sie können dies nach dem Koppeln Ihres Shelly BLU-Geräts tun. Im nächsten Schritt wird der Pairing-Assistent versuchen, Shelly BLU Geräte zu finden. Während der Suche senden Sie ein Bluetooth-Signal vom Gerät aus, indem Sie eine Taste drücken. Stellen Sie außerdem sicher, dass Sie sich in unmittelbarer Nähe von Homey befinden.",
    "titleselection": "Was möchtest du tun?",
    "nodevices": "Es wurden keine Geräte gefunden. Sie können es erneut versuchen oder eine manuelle Pairing-Methode verwenden, wenn Sie die IP-Adresse Ihres Shelly-Geräts kennen.",
    "again": "Erneut versuchen",
    "manual": "Manuelles Pairing",
    "title_icon_select": "Wähle ein Icon",
    "intro_upload": "Wenn Sie ein benutzerdefiniertes Icon für Ihr Gerät verwenden möchten, können Sie es hier hochladen. Das Icon muss im .svg-Format vorliegen.",
    "default_icon": "Standardicon verwenden",
    "save": "Speichern",
    "intro_vintage_icon": "Wählen Sie das Symbol aus, das Sie für Ihre Shelly Vintage verwenden möchten.",
    "error": "Beim Versuch, das Gerät hinzuzufügen, ist ein Fehler aufgetreten. Dies geschieht normalerweise, wenn das Gerät nicht auf der neuesten Firmware ist, ein batteriebetriebenes Gerät während des Pairings nicht aktiv bleibt oder es Netzwerkprobleme gibt. Sehen Sie die Anweisungen im Support-Thema im Community-Forum."
  },
  "util": {
    "400": "Fehler 400: ungültige API-Anforderung, senden Sie bitte einen Diagnosebericht aus den Einstellungen der App an den Entwickler, um dieses Problem zu lösen.",
    "401": "Fehler 401: Benutzeranmeldeinformationen fehlen oder dieser Benutzer ist nicht berechtigt, stellen Sie sicher, dass Sie die richtigen Benutzeranmeldeinformationen wie in der Shelly-Smartphone-App oder im Webinterface eingegeben haben.",
    "404": "Fehler 404: Gerät nicht gefunden, überprüfen Sie die Netzwerkverbindung und Konfiguration und stellen Sie sicher, dass das Shelly online und für Homey erreichbar ist.",
    "502": "Timeout-Fehler: Stellen Sie sicher, dass Sie die richtige IP-Adresse eingegeben haben und dass das Shelly-Gerät online ist.",
    "500": "Fehler 500: Interner Serverfehler",
    "unknownerror": "Unbekannter Fehler, sind Sie sicher, dass Sie die richtige IP-Adresse eingegeben haben und Homey im gleichen Netzwerk wie das Shelly-Gerät ist? Überprüfen Sie Ihre Einstellungen und versuchen Sie es erneut.",
    "unreachableerror": "Fehler: Die Anfrage ist fehlgeschlagen, weil das Shelly-Gerät nicht auf die Anfrage reagiert hat. Netzwerkprobleme werden manchmal durch einen Neustart von sowohl Homey als auch dem Shelly-Gerät gelöst.",
    "any_device": "jedem gerät",
    "any_action": "Jeder aktion"
  },
  "device": {
    "unreachable": "Gerät ist nicht erreichbar: ",
    "unreachable_on_cloud": "Das Gerät ist von Shelly Cloud aus nicht erreichbar, überprüfen Sie die Verbindung und ob die Cloud auf dem Gerät aktiviert ist.",
    "overpower": "Fehler: Gerät ist überlastet.",
    "overvoltage": "Fehler: Überspannung.",
    "overtemp": "Fehler: Gerätentemperatur zu hoch.",
    "overcurrent": "Fehler: Überstrom.",
    "maximum_dim_duration": "Shelly-Geräte haben eine maximale Dimm-Dauer von 5 Sekunden",
    "oauth2_repairing": "Aufgrund von Änderungen bei den Kommunikations-Cloud muss das Gerät neu authentifiziert werden, verwenden Sie hierfür das Neu-Kopplungs-Feature aus den Wartungseinstellungen in Homey."
  },
  "driver": {
    "wrongdevice": "Das Shelly-Gerät, mit dem Sie versuchen zu koppeln, entspricht nicht dem ausgewählten Shelly-Gerät im Kopplungs-Assistenten."
  },
  "settings": {
    "re_pair_required": "Geräteeinstellungen wurden gespeichert, eine erneute Kopplung (ohne Zurücksetzen) des Geräts mit Homey ist erforderlich, um diese Einstellung zu aktivieren. Warten Sie 30 Sekunden nach dem Entfernen, bevor Sie das Gerät erneut koppeln."
  },
  "app": {
    "no_pairing_device_found": "Kein Gerät zum Koppeln gefunden, stellen Sie sicher, dass Sie die oben beschriebenen Schritte ausführen."
  }
}