{
  "pair": {
    "title": "Add Shelly device",
    "nosettings": "Please fill in all the required fields.",
    "unauthorized": "Error 401: user credentials are missing or this user is not authorized, make sure you have copied the correct user credentials as entered in the Shelly smartphone app or Webinterface.",
    "servererror": "Error 500: internal server error",
    "timeout": "Timeout error: make sure you have entered the correct IP address and that the Shelly device is online.",
    "unknownerror": "Unknown error, are you sure you have entered the correct IP address and Homey is on the same network as the Shelly device? Please check your settings and try again.",
    "intro": "Enter the IP address and, if configured, your username and password for your Shelly device.",
    "intro-relay": "Pair your Shelly2 device as a device with two relay buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "intro-rollershutter": "Pair your Shelly2 device as a device with two roller shuttter buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "address": "IP Address",
    "username": "Username",
    "password": "Password",
    "single": "Use as single device",
    "polling": "Polling Frequency",
    "hostname": "Shelly Hostname:",
    "mac": "Shelly MAC Address:",
    "test" : "Test Connection",
    "testing" : "Connection test succesfull, you can now connect the Shelly device.",
    "connect": "Connect",
    "success": "Shelly device added succesfully",
    "htstartpairing": "Press the physical button on your Shelly sensor, wait for the LED inside the sensor to stay on and click the next button below."
  },
  "connect": {
    "intro": "Using the Shelly RGBW2 in CW/WW mode enables you to connect 2 LED strips as follows:",
    "single": "If you only attach one LED strip or you want to always keep the two channels in sync, you should check 'Use as single device'.",
    "device-type": "Set the Device Type in the Shelly app to 'Color'",
    "strip1": "Strip 1: CW pin to R terminal, WW pin to G terminal",
    "strip2": "Strip 2: CW pin to B terminal, WW pin to W terminal",
    "warning": "With this setup, controlling the LED strips with the Shelly apps is not practical."
  },
  "Unreachable": "Unreachable"
}
