{
  "pair": {
    "title": "Add Shelly device",
    "nosettings": "Please fill in all the required fields.",
    "intro": "Enter the IP address and, if configured, your username and password for your Shelly device.",
    "intro-relay": "Pair your Shelly2(.5) device as a device with two relay buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "intro-rollershutter": "Pair your Shelly2(.5) device as a device with two roller shuttter buttons (this can be configured in the Shelly smartphone app). Enter the IP address and, if configured, your username and password for your Shelly 2 device.",
    "address": "IP Address",
    "username": "Username",
    "password": "Password",
    "single": "Use as single device",
    "polling": "Polling Frequency",
    "hostname": "Shelly Hostname:",
    "device": "Shelly Device:",
    "deviceid": "Shelly Device ID:",
    "type": "Shelly Device Type:",
    "test" : "Test Connection",
    "testing" : "Connection test succesfull, you can now connect the Shelly device.",
    "connect": "Connect",
    "success": "Shelly device added succesfully",
    "no_device_config": "No suitable device config found. This device might not be supported yet, please report this to the developer.",
    "startpairingshelly": "Use this pairing wizard to pair any Shelly WiFi device. Before you continue make sure that your Shelly devices are connected to your Wi-Fi, you can do this by using the Shelly smartphone app. In case you want to pair a battery operated device, 'wake-up' your device by pressing the wake-up button or connect it to USB power. If you experience any issues getting the devices paired to Homey check your network settings, reboot the device and try again.",
    "startpairingshellybluetooth": "Use this pairing wizard to pair any Shelly Bluetooth (BLU) device. Please be aware that for a Shelly BLU device to work with Homey you will also need to enable a Bluetooth proxy on at least one Plus/Pro device in your network. The button for enabling this can be found in Homey under the device setting of a connected Plus/Pro device. On the next step the pairing wizard with try and discover any Shelly BLU devices. During the discovery process send a Bluetooth signal from the device, for instance by pressing a button. Also make sure the Shelly BLU device is in close range of Homey during pairing.",
    "titleselection": "What do you want to do?",
    "nodevices": "No devices have been discovered. You can try again or use manual pairing if you know the IP address of your Shelly device.",
    "again": "Try Again",
    "manual": "Manual Pairing",
    "title_icon_select": "Select icon",
    "intro_upload": "If you wish to use a custom icon for your device you can upload it here. The icon needs to be in .svg format.",
    "default_icon": "Use default",
    "save": "Save",
    "intro_vintage_icon": "Select which icon you want to use for your Shelly Vintage.",
    "error": "An error occured when trying to add the device. This usually happens when the device is not on the latest firmware, a battery powered device is not kept awake during pairing or there are networking issues. See the instructions in the support topic on the community forum."
  },
  "util": {
    "400": "Error 400: invalid API request, please send a diagnostic report from the app settings to the developer to help solve this issue.",
    "401": "Error 401: user credentials are missing or incorrect, make sure you have copied the correct user credentials as entered in the Shelly smartphone app or webinterface.",
    "404": "Error 404: device not found, check the network connection and configuration and make sure the Shelly is online and reachable for Homey.",
    "502": "Timeout error: make sure you have entered the correct IP address and that the Shelly device is online.",
    "500": "Error 500: internal server error",
    "unknownerror": "Unknown error, are you sure you have entered the correct IP address and Homey is on the same network as the Shelly device? Please check your settings and try again.",
    "unreachableerror": "Error: the request failed because the Shelly device did not respond to the request. The networking issues are sometimes solved by rebooting both Homey and the Shelly device.",
    "any_device": "With Any Device",
    "any_action": "With Any Action"
  },
  "device": {
    "unreachable": "Device is unreachable: ",
    "overpower": "Error: device is overpowered.",
    "overvoltage": "Error: overvoltage.",
    "overtemp": "Error: device temperature to high.",
    "overcurrent": "Error: overcurrent.",
    "maximum_dim_duration": "Shelly devices have a maximum of 5 seconds dim duration",
    "oauth2_repairing": "Device needs to be re-authenticated due to cloud communication changes, use the re-pair from the device maintenance settings in Homey to re-authenticate."
  },
  "driver": {
    "wrongdevice": "The Shelly device you are trying to pair does not match with the selected Shelly device in the pairing wizard."
  },
  "settings": {
    "re_pair_required": "Device settings have been saved, re-pairing (without resetting) the device to Homey is required to activate this setting. Wait 30 seconds after removing before re-pairing the device."
  },
  "app": {
    "no_pairing_device_found": "No device for pairing found, make sure you follow the steps above."
  }
}