{
  "pair": {
    "title": "Shelly toevoegen",
    "nosettings": "Vul a.u.b. alle verplichte velden in.",
    "intro": "Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly apparaat in.",
    "intro-relay": "Koppel je Shelly 2(.5) device als een device met twee relay knoppen (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "intro-rollershutter": "Koppel je Shelly 2(.5) device als een device met twee roller shutter knoppen  (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "address": "IP adres",
    "username": "Gebruikersnaam",
    "password": "Wachtwoord",
    "single": "Gebruik als één device",
    "polling": "Polling frequentie",
    "hostname": "Shelly hostname:",
    "device": "Shelly apparaat:",
    "deviceid": "Shelly apparaat ID:",
    "type": "Shelly apparaat type:",
    "test" : "Test connectie",
    "testing" : "Connectietest succesvol, je kan het Shelly apparaat nu verbinden.",
    "connect": "Verbind",
    "success": "Shelly apparaat succesvol toegevoegd",
    "no_device_config": "Geen geschikte apparaat config gevonden. Dit apparaat wordt mogelijk nog niet ondersteund. Rapporteer dit aub aan de ontwikkelaar.",
    "startpairingshelly": "Gebruik deze pairing wizard om elk Shelly WiFi apparaat te koppelen. Koppel het apparaat eerst met de Shelly smartphone app zodat het apparaat met WiFi is verbonden. Zorg ervoor dat zowel Homey als de Shelly een statisch IP adres hebben. Indien je een apparaat op batterijen wilt koppelen haal deze dan eerst uit de slaapstand via de wake-up button of door deze via USB van stroom te voorzien. Indien je problemen ervaart bij het koppelen doordat het apparaat niet wordt gevonden controleer dan je netwerk instellingen en probeer het apparaat te herstarten voordat je deze koppelt. Bezoek het ondersteuningstopic op het communityforum voor gedetailleerde instructies en probleemoplossing.",
    "startpairingshellybluetooth": "Gebruik deze pairing wizard om elk Shelly Bluetooth (BLU) apparaat te koppelen. Let op, om Shelly BLU apparaten goed te laten werken met Homey is het noodzakelijk om op minimaal één Shelly Plus/Pro een Bluetooth Proxy te activeren. Dit kan in Homey via de apparaat instellingen van een gekoppelde Shelly Plus/Pro. Je kan dit instellen na het koppelen van jouw Shelly BLU apparaat. Tijdens de volgende stap zal de pairing wizard proberen Shelly BLU apparaten te ontdekken. Stuur tijdens discovery een Bluetooth-signaal van het apparaat door op een knop te drukken. Zorg ook voor een korte afstand tussen het Shelly Blu apparaat en Homey. Bezoek het ondersteuningstopic op het communityforum voor gedetailleerde instructies en probleemoplossing.",
    "titleselection": "Wat wil je doen?",
    "nodevices": "Geen apparaten gevonden. Je kan het nog een keer proberen of je Shelly handmatig toevoegen als je het IP adres weet.",
    "again": "Probeer opnieuw",
    "manual": "Handmatig koppelen",
    "title_icon_select": "Selecteer icoon",
    "intro_upload": "Als je een eigen icoon voor je apparaat wilt gebruiken kan je deze hier uploaden. Het icoon moet in .svg format zijn.",
    "default_icon": "Gebruik standaard",
    "save": "Opslaan icon",
    "intro_vintage_icon": "Selecteer welk icoon die je wilt gebruiken voor je Shelly Vintage.",
    "error": "Er is een fout opgetreden tijdens het toevoegen. Dit gebeurt veelal als het apparaat niet de laatste firmware bevat, als een batterij gevoed apparaat niet wakker worden gehouden tijdens het pairen of als er netwerk problemen zijn. Bekijk de instructies in het support topic op het community forum."
  },
  "util": {
    "400": "Error 400: ongeldige API request, verstuur aub vanuit de app instellingen een diagnostisch report naar de ontwikkelaar om te helpen om dit issue op te lossen.",
    "401": "Error 401: gebruikers credentials ontbreken of onjuist, zorg ervoor dat je de gebruikers credentials goed hebt overgenomen zoals ingevoerd via de Shelly smartphone app of webinterface.",
    "404": "Error 404: apparaat niet gevonden, controleer de netwerkverbinding en instellingen om er zeker van te zijn dat de Shelly online en voor Homey bereikbaar is.",
    "502": "Timeout foutmelding: zorg ervoor dat je het correcte IP adres hebt ingevoerd en dat het Shelly apparaat online is.",
    "500": "Error 500: interne server fout",
    "unknownerror": "Onbekende fout, weet je zeker dat je het juist IP adres hebt opgegeven en dat het Shelly apparaat op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "unreachableerror": "Error: het verzoek is mislukt omdat het Shelly apparaat niet op het verzoek heeft gereageerd. Netwerkproblemen worden soms opgelost door zowel Homey als het Shelly apparaat opnieuw op te starten",
    "any_device": "elk apparaat",
    "any_action": "Elke actie"
  },
  "device": {
    "unreachable": "Apparaat is onbereikbaar: ",
    "unreachable_on_cloud": "Het apparaat is niet bereikbaar vanaf Shelly Cloud, controleer de verbinding en of de cloud is ingeschakeld op het apparaat.",
    "overpower": "Error: apparaat is overbelast.",
    "overvoltage": "Error: overvoltage.",
    "overtemp": "Error: apparaat temperatuur te hoog.",
    "overcurrent": "Error: overcurrent.",
    "maximum_dim_duration": "Shelly apparaten hebben een maximum van 5 seconden dim tijd",
    "oauth2_repairing": "Apparaat moet opnieuw geauthenticeerd worden vanwege wijzigingen in de cloud communicatie, gebruik de re-pair optie onder de apparaat onderhoud instellingen in Homey.",
    "deprecated": "**Waarschuwing:** __name__ maakt gebruik van een driver die al bijna 2 jaar verouderd is. Deze driver wordt verwijderd bij de volgende app-update. Koppel uw apparaat opnieuw om problemen te voorkomen."
  },
  "driver": {
    "wrongdevice": "Het Shelly apparaat dat je probeert te koppelen komt niet overeen met het gekozen Shelly apparaat in het apparaten toevoegscherm."
  },
  "settings": {
    "re_pair_required": "Apparaatinstellingen zijn opgeslagen, opnieuw koppelen (zonder te resetten) van het apparaat aan Homey is nodig om deze instelling te activeren. Wacht 30 seconden na het verwijderen voordat u het apparaat opnieuw koppelt."
  },
  "app": {
    "no_pairing_device_found": "Geen apparaat om te koppelen gevonden, zorg ervoor dat je bovenstaande stappen volgt."
  }
}
