{
  "pair": {
    "title": "Shelly apparaat toevoegen",
    "nosettings": "Vul a.u.b. alle verplichte velden in.",
    "unauthorized": "Foutmelding 401: gebruikers credentials ontbreken of deze gebruiker is niet geautoriseerd, zorg ervoor dat je de gebruikers credentials goed hebt overgenomen zoals ingevoerd via de Shelly smartphone app of webinterface.",
    "servererror": "Foutmelding 500: interne server fout",
    "timeout": "Timeout foutmelding: zorg ervoor dat je het correcte IP adres hebt ingevoerd en dat het Shelly apparaat online is.",
    "unknownerror": "Onbekende fout, weet je zeker dat je het juist IP adres hebt opgegeven en dat het Shelly apparaat op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "intro": "Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly apparaat in.",
    "intro-relay": "Koppel je Shelly 2 device als een device met twee relay knoppen (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "intro-rollershutter": "Koppel je Shelly 2 device als een device met twee roller shutter knoppen  (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "address": "IP adres",
    "username": "Gebruikersnaam",
    "password": "Wachtwoord",
    "single": "Gebruik als één device",
    "polling": "Polling frequentie",
    "hostname": "Shelly hostname:",
    "mac": "Shelly MAC adres:",
    "test" : "Test connectie",
    "testing" : "Connectietest succesvol, je kan het Shelly apparaat nu verbinden.",
    "connect": "Verbind",
    "success": "Shelly apparaat succesvol toegevoegd",
    "htstartpairing": "Druk op de fysieke knop op je Shelly sensor, wacht tot de LED aan blijft en klik dan op de volgende knop hieronder."
  },
  "connect": {
    "intro": "Als je de Shelly RGBW2 in CW/WW mode gebruikt, kan je als volgt twee LED-strips aansluiten:",
    "single": "Als je maar één LED strip aansluit of je wil de twee kanalen altijd gesynchroniseerd houden, moet je 'Gebruik als één device' aanvinken.",
    "device-type": "Zet het Device Type in the Shelly app op 'Color'",
    "strip1": "Strip 1: CW draad op R pin, WW draad op G pin",
    "strip2": "Strip 2: CW draad op B pin, WW draad op W pin",
    "warning": "Met deze setup is het bedienen van de LED-strips via de Shelly apps niet handig te doen."
  },
  "Unreachable": "Onbereikbaar"
}
