{
  "pair": {
    "title": "Shelly apparaat toevoegen",
    "nosettings": "Vul a.u.b. alle verplichte velden in.",
    "intro": "Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly apparaat in.",
    "intro-relay": "Koppel je Shelly 2(.5) device als een device met twee relay knoppen (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "intro-rollershutter": "Koppel je Shelly 2(.5) device als een device met twee roller shutter knoppen  (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "address": "IP adres",
    "username": "Gebruikersnaam",
    "password": "Wachtwoord",
    "single": "Gebruik als één device",
    "polling": "Polling frequentie",
    "hostname": "Shelly hostname:",
    "type": "Shelly apparaat type:",
    "test" : "Test connectie",
    "testing" : "Connectietest succesvol, je kan het Shelly apparaat nu verbinden.",
    "connect": "Verbind",
    "success": "Shelly apparaat succesvol toegevoegd",
    "startpairing": "Koppel het apparaat eerst met de Shelly smartphone app. Druk daarna op de fysieke knop op in je Shelly sensor of verwijder en herplaats de batterij om het apparaat wakker te maken. Wacht tot de LED aan blijft, de Shelly is dan verbonden met je WiFi netwerk. Klik vervolgens op de volgende knop hieronder.",
    "startpairingbutton": "Koppel het apparaat eerst met de Shelly smartphone app. Verbind een USB kabel aan de knop om er zeker van te zijn dat deze stroom heeft en verbonden is met WiFi voordat je verder gaat.",
    "startpairingmotion": "Koppel het apparaat eerst met de Shelly smartphone app. Schakel de CoAP communicatie optie in via de webinterface van de Shelly. Herstart je Shelly via de webinterface en ga verder met de pairing wizard direct nadat de sensor is herstart.",
    "titleselection": "Wat wil je doen?",
    "nodevices": "Geen apparaten gevonden. Je kan het nog een keer proberen of je Shelly handmatig toevoegen als je het IP adres weet.",
    "again": "Probeer opnieuw",
    "manual": "Handmatig koppelen",
    "title_icon_select": "Selecteer icoon",
    "intro_upload": "Als je een eigen icoon voor je apparaat wilt gebruiken kan je deze hier uploaden. Het icoon moet in .svg format zijn.",
    "default_icon": "Gebruik standaard",
    "save": "Opslaan",
    "intro_vintage_icon": "Selecteer welk icoon die je wilt gebruiken voor je Shelly Vintage."
  },
  "util": {
    "401": "Foutmelding 401: gebruikers credentials ontbreken of deze gebruiker is niet geautoriseerd, zorg ervoor dat je de gebruikers credentials goed hebt overgenomen zoals ingevoerd via de Shelly smartphone app of webinterface.",
    "502": "Timeout foutmelding: zorg ervoor dat je het correcte IP adres hebt ingevoerd en dat het Shelly apparaat online is.",
    "500": "Foutmelding 500: interne server fout",
    "unknownerror": "Onbekende fout, weet je zeker dat je het juist IP adres hebt opgegeven en dat het Shelly apparaat op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "any_device": "Voor elk apparaat",
    "any_action": "Bij elke actie"
  },
  "connect": {
    "intro": "Als je de Shelly RGBW2 in CW/WW mode gebruikt, kan je als volgt twee LED-strips aansluiten:",
    "single": "Als je maar één LED strip aansluit of je wil de twee kanalen altijd gesynchroniseerd houden, moet je 'Gebruik als één device' aanvinken.",
    "device-type": "Zet het Device Type in the Shelly app op 'Color'",
    "strip1": "Strip 1: CW draad op R pin, WW draad op G pin",
    "strip2": "Strip 2: CW draad op B pin, WW draad op W pin",
    "warning": "Met deze setup is het bedienen van de LED-strips via de Shelly apps niet handig te doen."
  },
  "device": {
    "unreachable": "Apparaat is onbereikbaar: "
  },
  "driver": {
    "wrongdevice": "Het Shelly apparaat dat je probeert te koppelen komt niet overeen met het gekozen Shelly apparaat in het apparaten toevoegscherm."
  }
}
