{
  "pair": {
    "title": "Shelly apparaat toevoegen",
    "nosettings": "Vul a.u.b. alle verplichte velden in.",
    "intro": "Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly apparaat in.",
    "intro-relay": "Koppel je Shelly 2(.5) device als een device met twee relay knoppen (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "intro-rollershutter": "Koppel je Shelly 2(.5) device als een device met twee roller shutter knoppen  (dit kan worden ingesteld in de Shelly smartphone app). Voer het IP adres en eventuele gebruikersnaam en wachtwoord van je Shelly2 apparaat in.",
    "address": "IP adres",
    "username": "Gebruikersnaam",
    "password": "Wachtwoord",
    "single": "Gebruik als één device",
    "polling": "Polling frequentie",
    "hostname": "Shelly hostname:",
    "device": "Shelly apparaat:",
    "deviceid": "Shelly apparaat ID:",
    "type": "Shelly apparaat type:",
    "test" : "Test connectie",
    "testing" : "Connectietest succesvol, je kan het Shelly apparaat nu verbinden.",
    "connect": "Verbind",
    "success": "Shelly apparaat succesvol toegevoegd",
    "no_device_config": "Geen geschikte apparaat config gevonden. Dit apparaat wordt mogelijk nog niet ondersteund. Rapporteer dit aub aan de ontwikkelaar.",
    "startpairing": "Koppel het apparaat eerst met de Shelly smartphone app. Druk daarna op de fysieke knop op in je Shelly sensor of verwijder en herplaats de batterij om het apparaat wakker te maken. Klik vervolgens op de volgende knop hieronder.",
    "startpairingbutton": "Koppel het apparaat eerst met de Shelly smartphone app. Verbind een USB kabel aan de knop om er zeker van te zijn dat deze stroom heeft en verbonden is met WiFi voordat je verder gaat.",
    "startpairingmotion": "Koppel het apparaat eerst met de Shelly smartphone app. Herstart je Shelly bewegingssensor via de webinterface en ga verder met de pairing wizard direct nadat de sensor is herstart.",
    "startpairingtrv": "Koppel het apparaat eerst met de Shelly smartphone app en installeer de radiatorknop volgens de instructies. Druk daarna kort de resetknop naast de USB-C oplader met een pin om er zeker van te zijn dat de TRV uit de slaapstand is. Vervolg daarna de pairing wizard.",
    "startpairingshelly": "Gebruik deze pairing wizard om elk Shelly apparaat te koppelen. Koppel het apparaat eerst met de Shelly smartphone app zodat het apparaat met WiFi is verbonden. Indien je een apparaat op batterijen wilt koppelen haal deze dan eerst uit de slaapstand via de wake-up button of door deze via USB van stroom te voorzien. Indien je problemen ervaart bij het koppelen doordat het apparaat niet wordt gevonden controleer dan je netwerk instellingen en probeer het apparaat te herstarten voordat je deze koppelt.",
    "titleselection": "Wat wil je doen?",
    "nodevices": "Geen apparaten gevonden. Je kan het nog een keer proberen of je Shelly handmatig toevoegen als je het IP adres weet.",
    "again": "Probeer opnieuw",
    "manual": "Handmatig koppelen",
    "title_icon_select": "Selecteer icoon",
    "intro_upload": "Als je een eigen icoon voor je apparaat wilt gebruiken kan je deze hier uploaden. Het icoon moet in .svg format zijn.",
    "default_icon": "Gebruik standaard",
    "save": "Opslaan",
    "intro_vintage_icon": "Selecteer welk icoon die je wilt gebruiken voor je Shelly Vintage.",
    "title_cloud_pairing": "Koppel Shelly over de cloud",
    "instructions_cloud_pairing": "Je staat op het punt om een Shelly cloud apparaat te koppelen. Volg hiervoor deze stappen:",
    "instructions_cloud_pairing_step_1": "Bezoek de Shelly Integrator Portal via deze",
    "instructions_cloud_pairing_step_2": "Log in op dit portal met je Shelly cloud credentials.",
    "instructions_cloud_pairing_step_3": "Vind het apparaat die je wil koppelen waarbij je ervoor zorgt dat dit apparaat van hetzelfde model is als het model dat je aan het toevoegen bent (als je apparaat niet wordt getoond in de lijst zal je deze eerst met de cloud moeten worden verbonden via de webinterface of de Shelly smartphone app).",
    "instructions_cloud_pairing_step_4": "Klik op het apparaat in de Shelly Integrator Portal en schakel de cloud integrator en apparaat control settings in voor dit apparaat.",
    "instructions_cloud_pairing_step_5": "Klik op Save in de Shelly Integrator Portal en klik vervolgens op de test connectie knop in deze pairing wizard.",
    "instructions_cloud_pairing_step_6": "Als je hieronder het juiste apparaat ID ziet kan je op de volgende knop klikken om verder te gaan met het koppelen van het apparaat.",
    "no_integrator_url": "Niet gelukt om Shelly Integrator Portal URL samen te stellen."
  },
  "util": {
    "400": "Error 400: ongeldige API request, verstuur aub vanuit de app instellingen een diagnostisch report naar de ontwikkelaar om te helpen om dit issue op te lossen.",
    "401": "Foutmelding 401: gebruikers credentials ontbreken of deze gebruiker is niet geautoriseerd, zorg ervoor dat je de gebruikers credentials goed hebt overgenomen zoals ingevoerd via de Shelly smartphone app of webinterface.",
    "502": "Timeout foutmelding: zorg ervoor dat je het correcte IP adres hebt ingevoerd en dat het Shelly apparaat online is.",
    "500": "Foutmelding 500: interne server fout",
    "unknownerror": "Onbekende fout, weet je zeker dat je het juist IP adres hebt opgegeven en dat het Shelly apparaat op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "any_device": "Voor elk apparaat",
    "any_action": "Bij elke actie"
  },
  "connect": {
    "intro": "Als je de Shelly RGBW2 in CW/WW mode gebruikt, kan je als volgt twee LED-strips aansluiten:",
    "single": "Als je maar één LED strip aansluit of je wil de twee kanalen altijd gesynchroniseerd houden, moet je 'Gebruik als één device' aanvinken.",
    "device-type": "Zet het Device Type in the Shelly app op 'Color'",
    "strip1": "Strip 1: CW draad op R pin, WW draad op G pin",
    "strip2": "Strip 2: CW draad op B pin, WW draad op W pin",
    "warning": "Met deze setup is het bedienen van de LED-strips via de Shelly apps niet handig te doen."
  },
  "device": {
    "unreachable": "Apparaat is onbereikbaar: ",
    "overpower": "Error: apparaat is overbelast.",
    "overvoltage": "Error: overvoltage.",
    "overtemp": "Error: apparaat temperatuur te hoog.",
    "overcurrent": "Error: overcurrent.",
    "maximum_dim_duration": "Shelly apparaten hebben een maximum van 5 seconden dim tijd",
    "oauth2_repairing": "Apparaat moet opnieuw geauthenticeerd worden vanwege wijzigingen in de cloud communicatie, gebruik de re-pair optie onder de apparaat onderhoud instellingen in Homey."
  },
  "driver": {
    "wrongdevice": "Het Shelly apparaat dat je probeert te koppelen komt niet overeen met het gekozen Shelly apparaat in het apparaten toevoegscherm."
  },
  "settings": {
    "title": "Shelly instellingen",
    "general": "Algemene instellingen",
    "intro-coap": "CoAP uitschakelen zal de CoAP listener stoppen en overschakelen naar HTTP polling. Dit kan handig zijn voor sommige netwerken waar CoAP niet werkt. Wees je ervan bewust dat hierdoor updates langzamer binnen komen en ook de input en action event (zoals short push etc.) functionaliteit uitschakelt. Herstart de app of Homey om de wijziging daadwerkelijk toe te passen.",
    "coap": "Uitschakelen CoAP?",
    "polling": "Polling frequentie in seconden",
    "success": "Instellingen zijn succesvol opgeslagen.",
    "save": "Opslaan"
  },
  "app": {
    "no_pairing_device_found": "Geen apparaat om te koppelen gevonden, zorg ervoor dat je bovenstaande stappen volgt."
  }
}
